/* automatically generated by rust-bindgen 0.59.0 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const TM_TT_TYPE__VEC4: &'static [u8; 10usize] = b"tm_vec4_t\0";
pub const TM_TT_TYPE__POSITION: &'static [u8; 12usize] = b"tm_position\0";
pub const TM_TT_TYPE__ROTATION: &'static [u8; 12usize] = b"tm_rotation\0";
pub const TM_TT_TYPE__SCALE: &'static [u8; 9usize] = b"tm_scale\0";
pub const TM_TT_TYPE__COLOR_RGB: &'static [u8; 13usize] = b"tm_color_rgb\0";
pub const TM_TT_TYPE__COLOR_RGBA: &'static [u8; 14usize] = b"tm_color_rgba\0";
pub const TM_TT_TYPE__RECT: &'static [u8; 10usize] = b"tm_rect_t\0";
pub const TM_THE_TRUTH_COMMON_TYPES_API_NAME: &'static [u8; 30usize] =
    b"tm_the_truth_common_types_api\0";
pub const TM_UNICODE_API_NAME: &'static [u8; 15usize] = b"tm_unicode_api\0";
pub const TM_UNIT_TEST_INTERFACE_NAME: &'static [u8; 15usize] = b"tm_unit_test_i\0";
pub const TM_VISIBILITY_FLAGS_EDITOR_INTERFACE_NAME: &'static [u8; 28usize] =
    b"tm_visibility_editor_name_i\0";
pub const TM_VISIBILITY_FLAGS_CONTEXT_INTERFACE_NAME: &'static [u8; 24usize] =
    b"tm_visibility_context_o\0";
pub const TM_VISIBILITY_FLAGS_API_NAME: &'static [u8; 24usize] = b"tm_visibility_flags_api\0";
pub const TM_TT_TYPE__VISIBILITY_FLAG: &'static [u8; 19usize] = b"tm_visibility_flag\0";
pub const TM_WEB_SOCKET_PROTOCOL_API_NAME: &'static [u8; 27usize] = b"tm_web_socket_protocol_api\0";
pub const TM_WEB_TALKER_API_NAME: &'static [u8; 18usize] = b"tm_web_talker_api\0";
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[doc = " Represents a 2D vector."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec2_t {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_tm_vec2_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec2_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_vec2_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec2_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec2_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec2_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec2_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec2_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec2_t),
            "::",
            stringify!(y)
        )
    );
}
#[doc = " Represents a 3D vector."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec3_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_tm_vec3_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec3_t>(),
        12usize,
        concat!("Size of: ", stringify!(tm_vec3_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec3_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec3_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec3_t>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec3_t),
            "::",
            stringify!(z)
        )
    );
}
#[doc = " Represents a 4D vector."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_vec4_t {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_tm_vec4_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_vec4_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_vec4_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_vec4_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_vec4_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_vec4_t>())).w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_vec4_t),
            "::",
            stringify!(w)
        )
    );
}
#[doc = " Represents a 4x4 matrix."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_mat44_t {
    pub xx: f32,
    pub xy: f32,
    pub xz: f32,
    pub xw: f32,
    pub yx: f32,
    pub yy: f32,
    pub yz: f32,
    pub yw: f32,
    pub zx: f32,
    pub zy: f32,
    pub zz: f32,
    pub zw: f32,
    pub wx: f32,
    pub wy: f32,
    pub wz: f32,
    pub ww: f32,
}
#[test]
fn bindgen_test_layout_tm_mat44_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_mat44_t>(),
        64usize,
        concat!("Size of: ", stringify!(tm_mat44_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_mat44_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_mat44_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xx as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xy as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xz as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).xw as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(xw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yx as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yy as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yz as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).yw as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(yw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zx as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zy as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zz as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).zw as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(zw)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wx as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wy as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).wz as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(wz)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_mat44_t>())).ww as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_mat44_t),
            "::",
            stringify!(ww)
        )
    );
}
#[doc = " Represents a transform in TRS form."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_transform_t {
    pub pos: tm_vec3_t,
    pub rot: tm_vec4_t,
    pub scl: tm_vec3_t,
}
#[test]
fn bindgen_test_layout_tm_transform_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_transform_t>(),
        40usize,
        concat!("Size of: ", stringify!(tm_transform_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_transform_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_transform_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).pos as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).rot as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(rot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_transform_t>())).scl as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_transform_t),
            "::",
            stringify!(scl)
        )
    );
}
#[doc = " Represents a rectangle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_rect_t {
    pub x: f32,
    pub y: f32,
    pub w: f32,
    pub h: f32,
}
#[test]
fn bindgen_test_layout_tm_rect_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_rect_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_rect_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_rect_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_rect_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).w as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_rect_t>())).h as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_rect_t),
            "::",
            stringify!(h)
        )
    );
}
#[doc = " Used to represent a string slice with pointer and length."]
#[doc = ""]
#[doc = " This lets you reason about parts of a string, which you are not able to do with standard"]
#[doc = " NULL-terminated strings."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_str_t {
    #[doc = " Pointer to string bytes."]
    pub data: *const ::std::os::raw::c_char,
    #[doc = " Length of the string."]
    pub size: u32,
    #[doc = " If set to *true*, indicates that there is an allocated NULL-byte after the string data. I.e."]
    #[doc = " `data[size] == 0`. This means that `data` can be used immediately as a C string without"]
    #[doc = " needing to copy it to a separate memory area."]
    #[doc = ""]
    #[doc = " If *false*, there may or may not be a NULL-byte at the end of the string and accessing"]
    #[doc = " `data[size]` may cause an access violation, so if you want to use it as a C-string you have"]
    #[doc = " to copy it to a new memory area and append a NULL byte."]
    #[doc = ""]
    #[doc = " Note that the NULL-byte is never included in the `size`."]
    pub null_terminated: u32,
}
#[test]
fn bindgen_test_layout_tm_str_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_str_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_str_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_str_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_str_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_str_t>())).data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_str_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_str_t>())).size as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_str_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_str_t>())).null_terminated as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_str_t),
            "::",
            stringify!(null_terminated)
        )
    );
}
#[doc = " Represents a time from the system clock."]
#[doc = ""]
#[doc = " You can assume the clock to be monotonically increasing, i.e. a larger `opaque` value represents"]
#[doc = " a later time, but you shouldn't assume anything else about what the `opaque` value represents or"]
#[doc = " the resolution of the timer. Instead, use [[tm_os_time_api->delta()]] to convert elapsed time to"]
#[doc = " seconds."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_clock_o {
    pub opaque: u64,
}
#[test]
fn bindgen_test_layout_tm_clock_o() {
    assert_eq!(
        ::std::mem::size_of::<tm_clock_o>(),
        8usize,
        concat!("Size of: ", stringify!(tm_clock_o))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_clock_o>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_clock_o))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_clock_o>())).opaque as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_clock_o),
            "::",
            stringify!(opaque)
        )
    );
}
#[doc = " Represents a unique 128-bit identifier."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_uuid_t {
    pub a: u64,
    pub b: u64,
}
#[test]
fn bindgen_test_layout_tm_uuid_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_uuid_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_uuid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_uuid_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_uuid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_uuid_t>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_uuid_t),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_uuid_t>())).b as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_uuid_t),
            "::",
            stringify!(b)
        )
    );
}
#[doc = " Represents an 8-bit per channel RGBA color in sRGB color space (Note: alpha is always linear.)"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_color_srgb_t {
    pub r: u8,
    pub g: u8,
    pub b: u8,
    pub a: u8,
}
#[test]
fn bindgen_test_layout_tm_color_srgb_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_color_srgb_t>(),
        4usize,
        concat!("Size of: ", stringify!(tm_color_srgb_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_color_srgb_t>(),
        1usize,
        concat!("Alignment of ", stringify!(tm_color_srgb_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).r as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).g as *const _ as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).b as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_color_srgb_t>())).a as *const _ as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_color_srgb_t),
            "::",
            stringify!(a)
        )
    );
}
#[doc = " Type representing a type in The Truth."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_tt_type_t {
    pub u64_: u64,
}
#[test]
fn bindgen_test_layout_tm_tt_type_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_type_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_type_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_type_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_type_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_tt_type_t>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_tt_type_t),
            "::",
            stringify!(u64_)
        )
    );
}
#[doc = " ID representing an object in The Truth."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_tt_id_t {
    pub __bindgen_anon_1: tm_tt_id_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tm_tt_id_t__bindgen_ty_1 {
    #[doc = " Used for comparing objects or storing them in hash tables."]
    pub u64_: u64,
    pub __bindgen_anon_1: tm_tt_id_t__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub struct tm_tt_id_t__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[test]
fn bindgen_test_layout_tm_tt_id_t__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(tm_tt_id_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_tt_id_t__bindgen_ty_1__bindgen_ty_1)
        )
    );
}
impl tm_tt_id_t__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn type_(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 10u8) as u64) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 10u8, val as u64)
        }
    }
    #[inline]
    pub fn generation(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(10usize, 22u8) as u64) }
    }
    #[inline]
    pub fn set_generation(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(10usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn index(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u64) }
    }
    #[inline]
    pub fn set_index(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        type_: u64,
        generation: u64,
        index: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 10u8, {
            let type_: u64 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(10usize, 22u8, {
            let generation: u64 = unsafe { ::std::mem::transmute(generation) };
            generation as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let index: u64 = unsafe { ::std::mem::transmute(index) };
            index as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_tm_tt_id_t__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_id_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_id_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_tt_id_t__bindgen_ty_1>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_tt_id_t__bindgen_ty_1),
            "::",
            stringify!(u64_)
        )
    );
}
#[test]
fn bindgen_test_layout_tm_tt_id_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_id_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_id_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_id_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_id_t))
    );
}
#[doc = " Type representing an undo scope in The Truth."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_tt_undo_scope_t {
    pub u64_: u64,
}
#[test]
fn bindgen_test_layout_tm_tt_undo_scope_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_tt_undo_scope_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_tt_undo_scope_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_tt_undo_scope_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_tt_undo_scope_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_tt_undo_scope_t>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_tt_undo_scope_t),
            "::",
            stringify!(u64_)
        )
    );
}
#[doc = " Type-safe representation of a hashed string."]
#[doc = ""]
#[doc = " !!! WARNING: WARNING"]
#[doc = "     In Visual Studio, string hashes won't use this string type, instead"]
#[doc = "     [[tm_strhash_t]] will be typedefed to `uint64_t`. The reason for this is that the"]
#[doc = "     [[TM_STATIC_HASH()]] macro is not seen as a constant by the MSVC compiler and thus using it"]
#[doc = "     to initialize global variables yields the"]
#[doc = "     [C2099](https://docs.microsoft.com/en-us/cpp/error-messages/compiler-errors-1/compiler-error-c2099?view=msvc-160)"]
#[doc = "     compiler error."]
#[doc = ""]
#[doc = "     This means that the type safety of string hashes won't be checked when compiling with MSVC."]
#[doc = "     Make sure you build your code under clang too, with `tmbuild --clang` to check the type"]
#[doc = "     safety of string hashes. Also, always use the macros [[TM_STRHASH()]] and"]
#[doc = "     [[TM_STRHASH_U64()]] to convert between [[tm_strhash_t]] and `uint64_t`. This ensures that"]
#[doc = "     the conversions work on all platforms."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_strhash_t {
    pub u64_: u64,
}
#[test]
fn bindgen_test_layout_tm_strhash_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_strhash_t>(),
        8usize,
        concat!("Size of: ", stringify!(tm_strhash_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_strhash_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_strhash_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_strhash_t>())).u64_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_strhash_t),
            "::",
            stringify!(u64_)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_o {
    _unused: [u8; 0],
}
#[doc = " Interface for allocating memory."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_i {
    #[doc = " Opaque struct storing instance data for this allocator."]
    pub inst: *mut tm_allocator_o,
    #[doc = " Memory scope used for tracking allocations made with this allocator. The memory scope is"]
    #[doc = " initialized by calling [[tm_allocator_api->create_child()]]."]
    pub mem_scope: u32,
    pub _padding_16: [::std::os::raw::c_char; 4usize],
    #[doc = " Basic memory allocator for The Machinery. The [[realloc()]] function provides a functionality"]
    #[doc = " similar to stdlib `realloc()`, but not exactly the same."]
    #[doc = ""]
    #[doc = " Its arguments are `a`, the [[tm_allocator_i]] structure; `ptr`, a pointer to the block being"]
    #[doc = " allocated/reallocated/freed; `old_size`, the current size of the memory block; `new_size`,"]
    #[doc = " the new size of the block."]
    #[doc = ""]
    #[doc = " Note that the caller of [[realloc()]] is responsible for keeping track of the sizes of memory"]
    #[doc = " blocks. This should not be an imposition, because the caller has to know the size of the"]
    #[doc = " memory block anyway. Otherwise, it couldn't use it without risking an access violation."]
    #[doc = ""]
    #[doc = " The realloc function should implement the following behavior:"]
    #[doc = ""]
    #[doc = " * When `new_size` is zero, it should behave like `free()` and return `NULL`."]
    #[doc = " * When `new_size` is not zero, it should behave like `realloc()`. In this case it should"]
    #[doc = "   return NULL if and only if it can't fulfill the request."]
    #[doc = ""]
    #[doc = " The `file` and `line` parameters are used together with the `mem_scope` member for tracking"]
    #[doc = " memory allocations. `file` and `line` should typically be set to the C `__FILE__` and"]
    #[doc = " `__LINE__` macros."]
    #[doc = ""]
    #[doc = " If you are writing a low-level collection class, it is recommended that you don't use"]
    #[doc = " `__FILE__` and `__LINE__` directly but instead pass them down from the caller. That way, the"]
    #[doc = " memory allocations get attributed to the class using the collection class instead of the"]
    #[doc = " collection class itself, which is more useful. See [[carray.inl]] for an example of this."]
    #[doc = ""]
    #[doc = " In addition to allocating memory, the allocator is also responsible for registering the"]
    #[doc = " allocation with the global memory tracker."]
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            ptr: *mut ::std::os::raw::c_void,
            old_size: u64,
            new_size: u64,
            file: *const ::std::os::raw::c_char,
            line: u32,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_tm_allocator_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_allocator_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).mem_scope as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(mem_scope)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>()))._padding_16 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(_padding_16)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_i>())).realloc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_i),
            "::",
            stringify!(realloc)
        )
    );
}
#[doc = " Allocator statstics."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_statistics_t {
    #[doc = " Total number of allocations in the `system` allocator."]
    pub system_allocation_count: u64,
    #[doc = " Total allocated bytes in the `system` allocator."]
    pub system_allocated_bytes: u64,
    #[doc = " Total reserved address space in the `vm` and `fixed_vm` allocators."]
    pub vm_reserved: u64,
    #[doc = " Total committed memory in the `vm` and `fixed_vm` allocators."]
    pub vm_committed: u64,
    #[doc = " Allocations in `system` allocator since this counter was externally reset."]
    pub system_churn_allocation_count: u64,
    #[doc = " Bytes allocated in the `system` allocator since this counter was externally reset."]
    pub system_churn_allocated_bytes: u64,
    #[doc = " Virtual memory commited since this counter was externally reset."]
    pub vm_churn_committed: u64,
}
#[test]
fn bindgen_test_layout_tm_allocator_statistics_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_statistics_t>(),
        56usize,
        concat!("Size of: ", stringify!(tm_allocator_statistics_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_statistics_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_statistics_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_allocation_count
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_allocated_bytes as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_reserved as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_reserved)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_committed as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_committed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_churn_allocation_count
                as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_churn_allocation_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).system_churn_allocated_bytes
                as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(system_churn_allocated_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_statistics_t>())).vm_churn_committed as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_statistics_t),
            "::",
            stringify!(vm_churn_committed)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_allocator_api {
    #[doc = " Allocator using the standard system [[realloc()]] function."]
    pub system: *mut tm_allocator_i,
    #[doc = " Allocator used to detect buffer overflow problems. This allocator allocates whole pages from"]
    #[doc = " the VM for every allocation and aligns the allocated memory at the end of the page. This"]
    #[doc = " means that any code that tries to write beyond the end of the allocated memory triggers a"]
    #[doc = " page fault exception. Similarly, writing to freed memory will trigger a page fault -- unless"]
    #[doc = " another page has been allocated to the same location which in practice seems rare."]
    #[doc = ""]
    #[doc = " If you are having issues with memory overwrites that are hard to pin down, you can try to"]
    #[doc = " switch out the regular allocator for the [[end_of_page]] one to see if you can detect the"]
    #[doc = " problem."]
    pub end_of_page: *mut tm_allocator_i,
    #[doc = " Allocator that allocates memory directly from the VM. Note that these allocations will always"]
    #[doc = " be rounded up to the page size, so it is not a good choice for small allocations. For large"]
    #[doc = " allocations it can be a good choice since allocating VM pages will never cause fragmentation."]
    #[doc = " Note though that since allocating from the VM involves a system call and requires the OS to"]
    #[doc = " clear the page (for security reasons) it can be slower than other allocators."]
    pub vm: *mut tm_allocator_i,
    #[doc = " Allocator system statistics."]
    pub statistics: *mut tm_allocator_statistics_t,
    #[doc = " Creates a child allocator of the specified `parent` allocator with the given description."]
    #[doc = " Parent and child allocators form a hierarchy that can be examined in the memory tracker."]
    pub create_child: ::std::option::Option<
        unsafe extern "C" fn(
            parent: *const tm_allocator_i,
            desc: *const ::std::os::raw::c_char,
        ) -> tm_allocator_i,
    >,
    #[doc = " Destroys a child allocator created by [[create_child()]]. When an allocator is destroyed we"]
    #[doc = " verify that all the memory allocated by that allocator has been freed (to prevent memory"]
    #[doc = " leaks)."]
    pub destroy_child: ::std::option::Option<unsafe extern "C" fn(child: *const tm_allocator_i)>,
    #[doc = " As [[destroy_child()]] but allows leaking up to `max_leaked_bytes` bytes without generating an"]
    #[doc = " error. This can be used if the allocator is being used by third-party code that is leaking"]
    #[doc = " stuff beyond our control."]
    #[doc = ""]
    #[doc = " It should not be left permanently in the code, rather the goal should be to get the third"]
    #[doc = " party code cleaned up so it doesn't leak anymore."]
    pub destroy_child_allowing_leaks: ::std::option::Option<
        unsafe extern "C" fn(child: *const tm_allocator_i, max_leaked_bytes: u64),
    >,
    #[doc = " Creates a root allocator based on `parent` that is allowed to leak. I.e., [[destroy_child()]]"]
    #[doc = " will never be called for the returned allocator and thus we will never check whether it leaks"]
    #[doc = " memory or not."]
    #[doc = ""]
    #[doc = " This should be used judiciously, because we want to have memory leak detection enabled for as"]
    #[doc = " many of our allocators as possible. However it can be useful for some global \"singleton\""]
    #[doc = " systems that never gets destroyed, such as our list of plugins, etc."]
    pub create_leaky_root_scope: ::std::option::Option<
        unsafe extern "C" fn(
            parent: *const tm_allocator_i,
            desc: *const ::std::os::raw::c_char,
        ) -> tm_allocator_i,
    >,
    #[doc = " Creates a fixed address VM allocator with the specified maximum size and tracking scope."]
    #[doc = ""]
    #[doc = " The fixed address allocator can be used to make allocations that stay at the same address,"]
    #[doc = " even if they get realloc:ed to a bigger size. It works by using the virtual memory system to"]
    #[doc = " first reserve a large range of address space, and then commit memory out of this reserved"]
    #[doc = " space as requested (with calls to `realloc`)."]
    #[doc = ""]
    #[doc = " The `reserve_size` parameter specifies the amount of address space that is reserved. This is"]
    #[doc = " also the maximum amount of memory that an allocation can be realloc:ed to. (Trying to"]
    #[doc = " allocate more will result in an error.)"]
    #[doc = ""]
    #[doc = " The `mem_scope` specifies the tracking scope for the allocator. You can use the scope"]
    #[doc = " returned from an existing allocator created by [[create_child()]] or"]
    #[doc = " [[create_leaky_root_scope()]]."]
    #[doc = ""]
    #[doc = " These allocators are useful when you want to allocate an array of objects and ensure that the"]
    #[doc = " objects in the array stay at a fixed address in memory, even as the array grows."]
    #[doc = ""]
    #[doc = " See also: [[create_leaky_root_scope()]]."]
    pub create_fixed_vm: ::std::option::Option<
        unsafe extern "C" fn(reserve_size: u64, mem_scope: u32) -> tm_allocator_i,
    >,
}
#[test]
fn bindgen_test_layout_tm_allocator_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_allocator_api>(),
        72usize,
        concat!("Size of: ", stringify!(tm_allocator_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_allocator_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_allocator_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).system as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(system)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).end_of_page as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(end_of_page)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).vm as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(vm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).statistics as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(statistics)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).create_child as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_child)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_allocator_api>())).destroy_child as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(destroy_child)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).destroy_child_allowing_leaks as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(destroy_child_allowing_leaks)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).create_leaky_root_scope as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_leaky_root_scope)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_allocator_api>())).create_fixed_vm as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_allocator_api),
            "::",
            stringify!(create_fixed_vm)
        )
    );
}
#[doc = " Listener for receiving information about changes to the API registry. Use [[add_listener()]] to add"]
#[doc = " a listener to the API registry."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_api_registry_listener_i {
    pub ud: *mut ::std::os::raw::c_void,
    #[doc = " Called when an implementation was added for the interface `name`."]
    pub add_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            name: *const ::std::os::raw::c_char,
            implementation: *const ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_api_registry_listener_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_api_registry_listener_i>(),
        16usize,
        concat!("Size of: ", stringify!(tm_api_registry_listener_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_api_registry_listener_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_api_registry_listener_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_listener_i>())).ud as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_listener_i),
            "::",
            stringify!(ud)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_listener_i>())).add_implementation as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_listener_i),
            "::",
            stringify!(add_implementation)
        )
    );
}
#[doc = " Global registry that keeps track of loaded APIs and interface implementations."]
#[doc = ""]
#[doc = " The difference between an API and an interface is that APIs only have a single implementation,"]
#[doc = " whereas interfaces can have many implementations."]
#[doc = ""]
#[doc = " For example the OS API [[tm_os_api]] provides the implementation of OS functions to access files,"]
#[doc = " memory, etc. It only has a single implementation for each supported platform, and it is this"]
#[doc = " implementation you call upon to perform OS functions."]
#[doc = ""]
#[doc = " In contrast, each module that supports unit tests implements the [[tm_unit_test_i]] interface. By"]
#[doc = " querying for the [[tm_unit_test_i]] interface, you can enumerate all these implementations and run"]
#[doc = " all the unit tests."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_api_registry_api {
    #[doc = " Sets an API in the registry. `name` is the name of the API that is implemented and `api` is a"]
    #[doc = " pointer to the struct of function pointers defining the API. `bytes` is the size of this"]
    #[doc = " struct."]
    #[doc = ""]
    #[doc = " APIs can be implemented only once. If you call [[set()]] again, it replaces the previous API"]
    #[doc = " pointers. This can be used to implement hot-reload of APIs."]
    pub set: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            api: *const ::std::os::raw::c_void,
            bytes: u32,
        ),
    >,
    #[doc = " Removes `API` if it is in use."]
    pub remove: ::std::option::Option<unsafe extern "C" fn(api: *const ::std::os::raw::c_void)>,
    #[doc = " Gets a pointer to the API implementing the API `name`."]
    #[doc = ""]
    #[doc = " `get(name)` is guaranteed to always return the same pointer, throughout the lifetime of an"]
    #[doc = " application (whether `set(name)` has been called zero, one or multiple times). It returns a"]
    #[doc = " pointer to internal API registry memory and the actual API pointers are copied to this memory"]
    #[doc = " by [[set()]]."]
    #[doc = ""]
    #[doc = " On hot-reload these function pointers will be overwritten, but this is transparent to users"]
    #[doc = " of the API. They can continue to use the same interface pointer and will call the new methods"]
    #[doc = " automatically. (If they have cached the function pointers in the API locally, they will keep"]
    #[doc = " calling the old methods.)"]
    #[doc = ""]
    #[doc = " Calling [[get()]] on an API that hasn't been loaded yet will return a struct full of NULL"]
    #[doc = " function pointers. When the API is loaded (and calls [[set()]]), these NULL pointers will be"]
    #[doc = " replaced by the real function pointers of the API."]
    #[doc = ""]
    #[doc = " To test whether an API has been loaded, you can test if it contains NULL function pointers or"]
    #[doc = " not."]
    pub get: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " As [[get()]], but indicates that this is an optional API, i.e. we will be able to continue to"]
    #[doc = " run even if this API is not available."]
    pub get_optional: ::std::option::Option<
        unsafe extern "C" fn(name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Adds an implementation of the interface named `name`."]
    pub add_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            implementation: *const ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Removes the specified implementation of the interface `name`."]
    pub remove_implementation: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            implementation: *const ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Returns an array of all the implementations implementing the interface `name`. The size of"]
    #[doc = " the array is returned in `count`."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     This function is kind of annoying to call, either improve this interface or provide an"]
    #[doc = "     alternative one."]
    pub implementations: ::std::option::Option<
        unsafe extern "C" fn(
            name: *const ::std::os::raw::c_char,
            count: *mut u32,
        ) -> *mut *mut ::std::os::raw::c_void,
    >,
    #[doc = " Adds a listener that will be called with changes to the api_registry. Currently, only an"]
    #[doc = " `add_implementation` callback is provided."]
    pub add_listener:
        ::std::option::Option<unsafe extern "C" fn(listener: *const tm_api_registry_listener_i)>,
    #[doc = " Returns a pointer to a static variable that survives plugin reloads. `id` is a unique"]
    #[doc = " identifier for the variable and `size` its size in bytes. The first time this function is"]
    #[doc = " called, the variable will be zero-initialized."]
    #[doc = ""]
    #[doc = " Use of static variables in DLLs can be problematic, because when the DLL is reloaded, the"]
    #[doc = " new instance of the DLL will get a new freshly initialized static variable, losing whatever"]
    #[doc = " content the variable had before reload. By using [[static_variable()]] instead, the variable"]
    #[doc = " data is saved in permanent memory."]
    #[doc = ""]
    #[doc = " Instead of this:"]
    #[doc = ""]
    #[doc = " ~~~c dont"]
    #[doc = " uint64_t count;"]
    #[doc = ""]
    #[doc = " void f()"]
    #[doc = " {"]
    #[doc = "     ++count;"]
    #[doc = " }"]
    #[doc = " ~~~"]
    #[doc = ""]
    #[doc = " You would do this:"]
    #[doc = ""]
    #[doc = " ~~~c"]
    #[doc = " uint64_t *count_ptr;"]
    #[doc = ""]
    #[doc = " void load(struct tm_api_registry_api *reg)"]
    #[doc = " {"]
    #[doc = "     count_ptr = (uint64_t *)reg->static_variable(TM_STATIC_HASH(\"my_count\", 0xa287d4b3ec9c2109ULL),"]
    #[doc = "         sizeof(uint64_t), __FILE__, __LINE__);"]
    #[doc = " }"]
    #[doc = ""]
    #[doc = " void f()"]
    #[doc = " {"]
    #[doc = "     ++*count_ptr;"]
    #[doc = " }"]
    #[doc = " ~~~"]
    pub static_variable: ::std::option::Option<
        unsafe extern "C" fn(
            id: tm_strhash_t,
            size: u32,
            file: *const ::std::os::raw::c_char,
            line: u32,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Print a log message about APIs that were requested with [[get()]] but were never found."]
    pub log_missing_apis: ::std::option::Option<unsafe extern "C" fn()>,
}
#[test]
fn bindgen_test_layout_tm_api_registry_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_api_registry_api>(),
        80usize,
        concat!("Size of: ", stringify!(tm_api_registry_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_api_registry_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_api_registry_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).set as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).remove as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(remove)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_api_registry_api>())).get as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).get_optional as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(get_optional)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).add_implementation as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(add_implementation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).remove_implementation as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(remove_implementation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).implementations as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(implementations)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).add_listener as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(add_listener)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).static_variable as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(static_variable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_api_registry_api>())).log_missing_apis as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_api_registry_api),
            "::",
            stringify!(log_missing_apis)
        )
    );
}
#[doc = " Function type for loading plugins or subparts of plugins."]
pub type tm_load_function =
    ::std::option::Option<unsafe extern "C" fn(reg: *mut tm_api_registry_api, load: bool)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_ui_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_draw2d_font_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_color_space_desc_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_application_o {
    _unused: [u8; 0],
}
#[doc = " Callback function for modal dialogs. This callback is called for every window/UI in the"]
#[doc = " application to draw the modal dialog on top of it and limit interaction to the modal UI. If the"]
#[doc = " callback function returns `true`, the modal UI will be closed."]
pub type tm_application_modal_f = ::std::option::Option<
    unsafe extern "C" fn(
        data: *mut ::std::os::raw::c_void,
        ui: *mut tm_ui_o,
        rect: tm_rect_t,
        font: *const tm_draw2d_font_t,
        font_scale: f32,
        ui_has_focus: bool,
        delta_time: f32,
    ) -> bool,
>;
#[doc = " Interface for applications. This interface allows applications to be defined in DLLs"]
#[doc = " and executed by a host program, so that they can be hot reloaded."]
#[doc = ""]
#[doc = " The application can expect that these methods will be called by the host on a fiber"]
#[doc = " locked to a specific job thread."]
#[doc = ""]
#[doc = " !!! TODO: API-REVIEW"]
#[doc = "     This API has become a bit of a \"dumping ground\" for storing stuff that you want to be"]
#[doc = "     generally accessible, but that doesn't really belong here. For example [[viewer_manager()]]"]
#[doc = "     probably shouldn't be here, because the foundation doesn't have a concept of \"viewers\". We"]
#[doc = "     should consider refactoring this to get rid of \"backward dependencies\" where `foundation` (a"]
#[doc = "     lower level library) depends on concepts from higher levels (ui, etc)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_application_api {
    #[doc = " Returns the current application as created by [[create()]]. If you call it before [[create()]] or"]
    #[doc = " after [[destroy()]], it will return 0."]
    pub application: ::std::option::Option<unsafe extern "C" fn() -> *mut tm_application_o>,
    #[doc = " Creates the application and returns it. `argc` and `argv` are the command line arguments"]
    #[doc = " for the application."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            argc: ::std::os::raw::c_int,
            argv: *mut *mut ::std::os::raw::c_char,
        ) -> *mut tm_application_o,
    >,
    #[doc = " Ticks the application. The application should return at regular intervals from the [[tick()]]"]
    #[doc = " function to give the host program the opportunity to reload the application DLL."]
    #[doc = ""]
    #[doc = " Should return `true` if the application should continue to run and `false` if it should be"]
    #[doc = " terminated."]
    pub tick: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o) -> bool>,
    #[doc = " Called to destroy the application after [[tick()]] has returned false."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o)>,
    #[doc = " Sets a \"modal\" callback function for the framework. If set, the modal callback function"]
    #[doc = " supplied will be called for each UI in the application to render a modal sheet/lightbox on"]
    #[doc = " top of the UI."]
    pub set_modal: ::std::option::Option<
        unsafe extern "C" fn(
            app: *mut tm_application_o,
            f: tm_application_modal_f,
            data: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Returns *true* if the application is running modal."]
    pub is_modal: ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    #[doc = " Returns the asset root of the application. May be zero if the application does not have an asset root."]
    pub asset_root:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> tm_tt_id_t>,
    #[doc = " True if the application should load the core project."]
    pub load_core:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    #[doc = " Updates the core project from the loaded core project. Make sure `load_core` is true before"]
    #[doc = " calling. The return value is true if anything was updated."]
    pub update_core:
        ::std::option::Option<unsafe extern "C" fn(app: *const tm_application_o) -> bool>,
    #[doc = " Signals the application to exit."]
    pub exit: ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o)>,
    #[doc = " Sets the cursor to be hidden for all windows of the application."]
    pub set_cursor_hidden:
        ::std::option::Option<unsafe extern "C" fn(app: *mut tm_application_o, hidden: bool)>,
    #[doc = " Returns the application's viewer manager that keeps track of all the application's viewers."]
    pub viewer_manager: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o) -> *mut tm_viewer_manager_o,
    >,
    #[doc = " Returns the API for the application's default render pipeline."]
    pub default_render_pipeline_api: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o) -> *mut tm_render_pipeline_api,
    >,
    #[doc = " Returns the scale factor used for the application's UI."]
    pub ui_scale_factor: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o, ui: *mut tm_ui_o) -> f32,
    >,
    #[doc = " Returns the directory where application data is stored."]
    pub data_dir: ::std::option::Option<
        unsafe extern "C" fn(app: *mut tm_application_o) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Returns the color space and output format used by the application windows."]
    #[doc = " TODO (Frank): Should we support different color spaces per window?"]
    pub color_space: ::std::option::Option<
        unsafe extern "C" fn(
            app: *const tm_application_o,
            color_space: *mut tm_color_space_desc_t,
            format: *mut u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_application_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_application_api>(),
        128usize,
        concat!("Size of: ", stringify!(tm_application_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_application_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_application_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).application as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(application)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).create as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).tick as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(tick)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).destroy as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).set_modal as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(set_modal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).is_modal as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(is_modal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).asset_root as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(asset_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).load_core as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(load_core)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).update_core as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(update_core)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).exit as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(exit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).set_cursor_hidden as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(set_cursor_hidden)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).viewer_manager as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(viewer_manager)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).default_render_pipeline_api as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(default_render_pipeline_api)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_application_api>())).ui_scale_factor as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(ui_scale_factor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).data_dir as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(data_dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_application_api>())).color_space as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_application_api),
            "::",
            stringify!(color_space)
        )
    );
}
#[doc = " Defines a callback API for the application to call into plugins."]
#[doc = ""]
#[doc = " If and when these callbacks are called is defined by the application. For example, not all"]
#[doc = " applications have the concept of a main loop and thus would never call `TICK`. Not all"]
#[doc = " applications have the concept of a \"main truth\" and thus would never call `SET_MAIN_TRUTH`."]
#[doc = ""]
#[doc = " It is recommended to rely on these calls as little as possible."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_the_truth_o {
    _unused: [u8; 0],
}
#[doc = " Configuration settings for the asset database."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_config_t {
    #[doc = " Allocator used by the database."]
    pub allocator: *mut tm_allocator_i,
    #[doc = " Optional. Custom file system APIs used to access the database. If NULL, the standard file"]
    #[doc = " system will be used."]
    pub fs: *mut tm_os_file_system_api,
    pub file_io: *mut tm_os_file_io_api,
}
#[test]
fn bindgen_test_layout_tm_asset_database_config_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_database_config_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_asset_database_config_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_database_config_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_database_config_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_config_t>())).allocator as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_config_t>())).fs as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(fs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_config_t>())).file_io as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_config_t),
            "::",
            stringify!(file_io)
        )
    );
}
#[doc = " Information about a saved item in the database."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_dabase_saved_item_t {
    pub uuid: tm_uuid_t,
    pub is_directory: bool,
    pub _padding_30: [::std::os::raw::c_char; 7usize],
}
#[test]
fn bindgen_test_layout_tm_asset_dabase_saved_item_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_dabase_saved_item_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_asset_dabase_saved_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_dabase_saved_item_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_dabase_saved_item_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>())).uuid as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(uuid)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>())).is_directory as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(is_directory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_dabase_saved_item_t>()))._padding_30 as *const _
                as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_dabase_saved_item_t),
            "::",
            stringify!(_padding_30)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_database_api {
    #[doc = " Creates a new asset database in `file` for saving The Truth `tt`."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            config: *const tm_asset_database_config_t,
        ) -> *mut tm_asset_database_o,
    >,
    #[doc = " Opens an existing asset database `file` for loading into The Truth `tt`. Note that this does"]
    #[doc = " not load the assets from the database into `tt`, you have to explicitly call [[load()]] to load"]
    #[doc = " the assets."]
    pub open: ::std::option::Option<
        unsafe extern "C" fn(
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            config: *const tm_asset_database_config_t,
        ) -> *mut tm_asset_database_o,
    >,
    #[doc = " Closes a database opened with [[create()]] or [[open()]]."]
    pub close: ::std::option::Option<unsafe extern "C" fn(db: *mut tm_asset_database_o)>,
    #[doc = " Saves the assets that have been modified since the last save/load of the database. Assets"]
    #[doc = " that have been deleted are deleted from the database."]
    pub save_modified: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset_root: tm_tt_id_t),
    >,
    #[doc = " As [[save_modified()]], but ignores the assets listed in `ignore`, even if they have"]
    #[doc = " modifications."]
    pub save_modified_except: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            asset_root: tm_tt_id_t,
            ignore: *mut tm_tt_id_t,
            num_ignore: u32,
        ),
    >,
    #[doc = " Saves the specified `asset`."]
    pub save_asset: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_tt_id_t),
    >,
    #[doc = " Deletes the specified `asset`."]
    pub delete_asset: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_tt_id_t),
    >,
    #[doc = " Reverts the `asset` to the last saved version in the project. Returns *true* if the asset"]
    #[doc = " could be successfully reverted."]
    pub revert_asset: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            asset: tm_tt_id_t,
            undo_scope: tm_tt_undo_scope_t,
        ) -> bool,
    >,
    #[doc = " Loads all the assets from the database into the corresponding Truth. Returns the loaded asset"]
    #[doc = " root. If `load_fraction` is not `NULL`, it's value will be continuously updated with the"]
    #[doc = " progress of the load as a fraction in the range [0,1], reaching 1.0f when loading is"]
    #[doc = " complete."]
    pub load: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, load_fraction: *mut f32) -> tm_tt_id_t,
    >,
    #[doc = " Returns the name the `item` (asset or directory) had when saved. This can be used to detect"]
    #[doc = " changes to item names. Returns `NULL` if the item has not been saved."]
    pub saved_name: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            item: tm_uuid_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Returns the directory the `item` (asset or directory) was last saved in. This can be used to"]
    #[doc = " detect moved items. Returns `{0}` f the item has not been saved."]
    pub saved_directory: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, item: tm_uuid_t) -> tm_uuid_t,
    >,
    #[doc = " Returns the saved version of the asset in the database. Returns 0 if the asset does not exist in the database."]
    pub saved_version: ::std::option::Option<
        unsafe extern "C" fn(db: *mut tm_asset_database_o, asset: tm_uuid_t) -> u64,
    >,
    #[doc = " Returns an carray of all saved items (assets and directories) that exist in the saved data,"]
    #[doc = " allocated using the supplied temp allocator. This can be used to find items that have been"]
    #[doc = " deleted since the save."]
    pub all_saved_items: ::std::option::Option<
        unsafe extern "C" fn(
            db: *mut tm_asset_database_o,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut tm_asset_dabase_saved_item_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_asset_database_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_database_api>(),
        104usize,
        concat!("Size of: ", stringify!(tm_asset_database_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_database_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_database_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).open as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(open)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).close as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(close)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_modified as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_modified)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_modified_except as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_modified_except)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).save_asset as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(save_asset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).delete_asset as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(delete_asset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).revert_asset as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(revert_asset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_database_api>())).load as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(load)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_name as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_directory as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_directory)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).saved_version as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(saved_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_database_api>())).all_saved_items as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_database_api),
            "::",
            stringify!(all_saved_items)
        )
    );
}
#[doc = " Arguments for the [[tm_asset_io_i->import_asset()]] function."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct tm_asset_io_import {
    #[doc = " Allocator that can be used by the import task."]
    pub allocator: *mut tm_allocator_i,
    #[doc = " Truth to import into."]
    pub tt: *mut tm_the_truth_o,
    #[doc = " Optional. If non-zero, specifies that the file should be re-imported into this existing asset"]
    #[doc = " object. Note that `reimport_into` should be the data object below the asset, not the asset"]
    #[doc = " itself."]
    pub reimport_into: tm_tt_id_t,
    #[doc = " Optional. Specifies the ASSET_DIRECTORY to import the file into. This parameter is ignored if"]
    #[doc = " `reimport_into` is set. If zero, imports into the top-level directory."]
    pub target_dir: tm_tt_id_t,
    #[doc = " Asset root to import into."]
    pub asset_root: tm_tt_id_t,
    #[doc = " Optional. UI where the import action happened (used to find asset browser to select the"]
    #[doc = " imported item). If not specified, we will search for an asset browser window globally (not in"]
    #[doc = " any particular UI)."]
    #[doc = ""]
    #[doc = " TODO: It's a bit ugly to have a backwards dependency like this, because the foundation API is"]
    #[doc = " lower-level than the UI API."]
    pub ui: *mut tm_ui_o,
    #[doc = " Optional. Specifies the `asset_browser` UI object and the version of that UI object at the"]
    #[doc = " start of the import operation. This is used to determine if the imported item should be"]
    #[doc = " selected or not. (We only want to select it if the asset browser hasn't been touched since"]
    #[doc = " the import started.)"]
    #[doc = ""]
    #[doc = " If not specified, item will not be selected."]
    #[doc = ""]
    #[doc = " TODO: It is a bit ugly to pass down high level information like this to the low-level import"]
    #[doc = " task, consider refactoring this."]
    pub asset_browser: tm_tt_id_t,
    pub asset_browser_version_at_start: u64,
    #[doc = " Undo-scope for the import operation."]
    pub undo_scope: tm_tt_undo_scope_t,
}
#[test]
fn bindgen_test_layout_tm_asset_io_import() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_import>(),
        72usize,
        concat!("Size of: ", stringify!(tm_asset_io_import))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_import>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_import))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).allocator as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).tt as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(tt)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).reimport_into as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(reimport_into)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).target_dir as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(target_dir)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).asset_root as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).ui as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(ui)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).asset_browser as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_browser)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_import>())).asset_browser_version_at_start
                as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(asset_browser_version_at_start)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_import>())).undo_scope as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_import),
            "::",
            stringify!(undo_scope)
        )
    );
}
#[doc = " Interface for an asset importer. Implement this interface to add a new asset import type to the"]
#[doc = " engine."]
#[doc = ""]
#[doc = " !!! TODO: API-REVIEW:"]
#[doc = "     Should this interface be registered with [[tm_api_registry_api->add_implementation()]]"]
#[doc = "     rather than [[tm_asset_io_api->add_asset_io()]]."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_io_i {
    pub inst: *mut tm_asset_io_o,
    #[doc = " Returns `true` if this io interface is enabled. Required. If this returns `false`, asset"]
    #[doc = " imports through this interface are disabled."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Should be *Optional* -- and if not implemented, the importer should always be enabled."]
    pub enabled: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_asset_io_o) -> bool>,
    #[doc = " Returns `true` if this asset IO interface can import archives with the file extension"]
    #[doc = " `extension`. Optional, if not implemented, nothing can be imported."]
    pub can_import: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            extension: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    #[doc = " Returns `true` if this asset IO interface can re-import the specified truth asset (of type"]
    #[doc = " [[TM_TT_TYPE__ASSET]]). Optional, if not implemented, nothing can be re-imported."]
    pub can_reimport: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> bool,
    >,
    #[doc = " Appends a string with all supported file extensions the asset IO interface can import to the"]
    #[doc = " carray `output`, allocated by `ta`. Each file extension should be separated by the"]
    #[doc = " `separator` string. Optional, if not implemented, nothing can be imported."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     The \"stringly-typed\" approach here is a bit weird, return an array instead?"]
    pub importer_extensions_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    #[doc = " Appends a string with all supported file descriptions the asset IO interface can import to"]
    #[doc = " the carray `output`, allocated by `ta`. Each file extension should be separated by the"]
    #[doc = " `separator` string. Optional, if not implemented, nothing can be imported."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     This function should be optional and if you leave it out the description should"]
    #[doc = "     just be \"XXX file\" where `XXX` is the extension."]
    pub importer_description_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    #[doc = " Imports the specified `file` into The Truth using the `import` arguments."]
    #[doc = ""]
    #[doc = " Optional, if not implemented, nothing can be imported."]
    #[doc = ""]
    #[doc = " If non-zero, the return value is the ID of the background task from [[tm_task_system_api]] that"]
    #[doc = " does the import."]
    pub import_asset: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            file: *const ::std::os::raw::c_char,
            import: *const tm_asset_io_import,
        ) -> u64,
    >,
    #[doc = " Returns `true` if this asset IO interface can export the specified Truth asset (of type"]
    #[doc = " [[TM_TT_TYPE__ASSET]]). Optional, if not implemented, nothing can be exported."]
    pub can_export: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> bool,
    >,
    #[doc = " Returns the extension that should be used for the exported file. Required if [[can_export()]]"]
    #[doc = " returns true."]
    #[doc = ""]
    #[doc = " !!! TODO: TODO"]
    #[doc = "     Should we support exporting to different formats? I.e. allow an image to be exported"]
    #[doc = "     as JPEG, PNG, etc regardless of the source format."]
    pub exporter_extension: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            tt: *mut tm_the_truth_o,
            asset: tm_tt_id_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Exports the specified truth `asset` to `file`. The asset should be of type [[TM_TT_TYPE__ASSET]]. Required if"]
    #[doc = " [[can_export()]] returns `true`."]
    pub export_asset: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_asset_io_o,
            file: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            asset_root: tm_tt_id_t,
            asset: tm_tt_id_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_asset_io_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_i>(),
        80usize,
        concat!("Size of: ", stringify!(tm_asset_io_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).enabled as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_import as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_import)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_reimport as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_reimport)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).importer_extensions_string as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(importer_extensions_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).importer_description_string as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(importer_description_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).import_asset as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(import_asset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).can_export as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(can_export)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_asset_io_i>())).exporter_extension as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(exporter_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_i>())).export_asset as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_i),
            "::",
            stringify!(export_asset)
        )
    );
}
#[doc = " API for talking to the Asset IO system."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_asset_io_api {
    #[doc = " Adds a new asset IO interface to the registry."]
    pub add_asset_io: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_asset_io_i)>,
    #[doc = " Remove an asset IO interface from the registry."]
    pub remove_asset_io: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_asset_io_i)>,
    #[doc = " Returns the first asset IO interface that supports importing the file format"]
    #[doc = " `extension`."]
    pub importer: ::std::option::Option<
        unsafe extern "C" fn(extension: *const ::std::os::raw::c_char) -> *mut tm_asset_io_i,
    >,
    #[doc = " Returns the first asset IO interface that supports re-importing the specified asset."]
    pub reimporter: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset: tm_tt_id_t) -> *mut tm_asset_io_i,
    >,
    #[doc = " Returns the first asset IO interface that supports exporting the specified asset."]
    pub exporter: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset: tm_tt_id_t) -> *mut tm_asset_io_i,
    >,
    #[doc = " Returns all registered asset IO interfaces in `interfaces`. `interfaces` must have room to"]
    #[doc = " hold all `interfaces`. Returns the total number of interfaces. Pass `NULL` for `interfaces'"]
    #[doc = " to query the number of active interfaces."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Should take length of `interfaces` as argument to prevent overwrite."]
    pub io_interfaces:
        ::std::option::Option<unsafe extern "C" fn(interfaces: *mut *mut tm_asset_io_i) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_asset_io_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_asset_io_api>(),
        48usize,
        concat!("Size of: ", stringify!(tm_asset_io_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_asset_io_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_asset_io_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).add_asset_io as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(add_asset_io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).remove_asset_io as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(remove_asset_io)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).importer as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(importer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).reimporter as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(reimporter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).exporter as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(exporter)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_asset_io_api>())).io_interfaces as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_asset_io_api),
            "::",
            stringify!(io_interfaces)
        )
    );
}
#[doc = " Functions for dealing with Base64 encoded content."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_base_64_api {
    #[doc = " Returns the number of bytes a binary chunk of size `raw_size` will use when encoded. This"]
    #[doc = " does not include the `\\0` character at the end of the string."]
    pub encoded_size: ::std::option::Option<unsafe extern "C" fn(raw_size: u64) -> u64>,
    #[doc = " Encodes the binary data `raw` of size `raw_size` in Base64 format and stores the encoded"]
    #[doc = " string in `encoded`. Also adds a `\\0` terminator at the end of the string. `encode` must have"]
    #[doc = " room for the encoded string and the 0 character (`encoded_size()+ 1`). Returns the number of"]
    #[doc = " written characters, not including the `\\0` character."]
    pub encode: ::std::option::Option<
        unsafe extern "C" fn(
            encoded: *mut ::std::os::raw::c_char,
            raw: *const u8,
            raw_size: u64,
        ) -> u64,
    >,
    #[doc = " Returns the number of bytes that the encoded chunk `encoded` will decode to."]
    pub decoded_size: ::std::option::Option<
        unsafe extern "C" fn(encoded: *const ::std::os::raw::c_char, encoded_size: u64) -> u64,
    >,
    #[doc = " Decodes the data in `encoded` into `raw`. `raw` must have room for [[decoded_size()]] bytes."]
    #[doc = " Returns the number of decoded characters. If an invalid Base64 sequence is found the decoding"]
    #[doc = " is aborted. This will cause the returned value to be smaller than [[decoded_size()]]."]
    pub decode: ::std::option::Option<
        unsafe extern "C" fn(
            raw: *mut u8,
            encoded: *const ::std::os::raw::c_char,
            encoded_size: u64,
        ) -> u64,
    >,
}
#[test]
fn bindgen_test_layout_tm_base_64_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_base_64_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_base_64_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_base_64_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_base_64_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).encoded_size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(encoded_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).encode as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(encode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).decoded_size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(decoded_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_base_64_api>())).decode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_base_64_api),
            "::",
            stringify!(decode)
        )
    );
}
pub const TM_BOUNDING_VOLUME_TYPE_SPHERE: tm_bounding_volume_type = 0;
pub const TM_BOUNDING_VOLUME_TYPE_BOX: tm_bounding_volume_type = 1;
#[doc = " The type of the bounding volume."]
pub type tm_bounding_volume_type = ::std::os::raw::c_int;
#[doc = " Represents a spherical bounding volume."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_bounding_volume_sphere_t {
    pub visibility_mask: u64,
    pub culling_disabled: bool,
    pub _padding_18: [::std::os::raw::c_char; 3usize],
    pub position: tm_vec3_t,
    pub radius: f32,
    pub _padding_21: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_bounding_volume_sphere_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_bounding_volume_sphere_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_bounding_volume_sphere_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_bounding_volume_sphere_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_bounding_volume_sphere_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).visibility_mask as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(visibility_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).culling_disabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(culling_disabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>()))._padding_18 as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(_padding_18)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).position as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>())).radius as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_sphere_t>()))._padding_21 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_sphere_t),
            "::",
            stringify!(_padding_21)
        )
    );
}
#[doc = " Represents a box bounding volume."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_bounding_volume_box_t {
    pub visibility_mask: u64,
    pub culling_disabled: bool,
    pub _padding_29: [::std::os::raw::c_char; 3usize],
    pub tm: tm_mat44_t,
    pub min: tm_vec3_t,
    pub max: tm_vec3_t,
    pub _padding_33: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_bounding_volume_box_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_bounding_volume_box_t>(),
        104usize,
        concat!("Size of: ", stringify!(tm_bounding_volume_box_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_bounding_volume_box_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_bounding_volume_box_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).visibility_mask as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(visibility_mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).culling_disabled as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(culling_disabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>()))._padding_29 as *const _ as usize
        },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(_padding_29)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).tm as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(tm)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).min as *const _ as usize },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_bounding_volume_box_t>())).max as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_bounding_volume_box_t>()))._padding_33 as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_bounding_volume_box_t),
            "::",
            stringify!(_padding_33)
        )
    );
}
#[doc = " Low-level interface to buddy allocator system."]
#[doc = ""]
#[doc = " Implements a buddy allocator (http://en.wikipedia.org/wiki/Buddy_memory_allocation)"]
#[doc = " in a fixed size memory buffer. The buddy allocator's headers and block bitmap are"]
#[doc = " stored directly in the memory buffer."]
#[doc = ""]
#[doc = " The buddy allocator cannot grow outside its memory buffer. If you attempt to"]
#[doc = " allocate beyond the size of the memory buffer, [[realloc()]] will return `NULL`."]
#[doc = ""]
#[doc = " The raw buddy allocator interface is not thread-safe."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buddy_allocator_raw_api {
    #[doc = " Initializes the specified memory region as a buddy allocator. The `block_size`"]
    #[doc = " is the smallest memory allocation in bytes that the buddy allocator can make."]
    #[doc = " Allocations are always a power-of-two of the block size. The `block_size`"]
    #[doc = " must be at least 16 bytes."]
    pub init:
        ::std::option::Option<unsafe extern "C" fn(buffer: *mut u8, size: u32, block_size: u32)>,
    #[doc = " Allocates memory using the buddy allocation strategy. The buffer must have"]
    #[doc = " been initialized with [[init()]] before [[realloc()]] is called."]
    pub realloc: ::std::option::Option<
        unsafe extern "C" fn(
            buffer: *mut u8,
            ptr: *mut ::std::os::raw::c_void,
            old_size: u64,
            new_size: u64,
        ) -> *mut ::std::os::raw::c_void,
    >,
}
#[test]
fn bindgen_test_layout_tm_buddy_allocator_raw_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buddy_allocator_raw_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_buddy_allocator_raw_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buddy_allocator_raw_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buddy_allocator_raw_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_raw_api>())).init as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_raw_api),
            "::",
            stringify!(init)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buddy_allocator_raw_api>())).realloc as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_raw_api),
            "::",
            stringify!(realloc)
        )
    );
}
#[doc = " High-level interface to the buddy allocator system."]
#[doc = ""]
#[doc = " Uses a sequency of bigger and bigger buddy allocator arenas to provide growable buddy allocators."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buddy_allocator_api {
    #[doc = " Create a buddy allocator stack. This allocator uses a sequence of larger and"]
    #[doc = " larger buddy allocators to fulfill allocation requests. The buffer for each"]
    #[doc = " buddy allocator is allocated using the backing_allocator."]
    #[doc = ""]
    #[doc = " `initial_size` is the size of the first buddy allocator created. Don't set"]
    #[doc = " this to too small a value (probably at least 16 K), since that will create"]
    #[doc = " a large number of allocators in the stack."]
    #[doc = ""]
    #[doc = " `block_size` is the block size of the buddy allocators."]
    #[doc = ""]
    #[doc = " The created allocator is thread-safe."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            backing: *mut tm_allocator_i,
            initial_size: u32,
            block_size: u32,
        ) -> *mut tm_allocator_i,
    >,
    #[doc = " Destroys a buddy allocator created by [[create()]]."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i)>,
}
#[test]
fn bindgen_test_layout_tm_buddy_allocator_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buddy_allocator_api>(),
        16usize,
        concat!("Size of: ", stringify!(tm_buddy_allocator_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buddy_allocator_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buddy_allocator_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buddy_allocator_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buddy_allocator_api),
            "::",
            stringify!(destroy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_o {
    _unused: [u8; 0],
}
#[doc = " Manages a set of \"buffers\". A buffer is an immutable blob of binary data ."]
#[doc = ""]
#[doc = " The buffer API is thread-safe, but it is up to the caller of the API to make sure that the *use*"]
#[doc = " of the buffers is thread-safe. (I.e., that no-one is currently reading the content of a buffer"]
#[doc = " that is being released.)"]
#[doc = ""]
#[doc = " !!! TODO: API-REVIEW"]
#[doc = "     Should we get rid of the concept of a buffer ID and just refer to buffers by their hash?"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_i {
    pub inst: *mut tm_buffers_o,
    #[doc = " Allocates a buffer of `size` bytes to be passed into the [[add()]] function. If `initialize` is"]
    #[doc = " non-zero, the buffer will be initialized with data copied from the `initialize` pointer."]
    #[doc = " Otherwise you are responsible for filling the buffer with data yourself before calling"]
    #[doc = " [[add()]]."]
    #[doc = ""]
    #[doc = " Note that you must call [[add()]] with the allocated data. If you don't, the allocated memory"]
    #[doc = " is leaked."]
    pub allocate: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            size: u64,
            initialize: *const ::std::os::raw::c_void,
        ) -> *mut ::std::os::raw::c_void,
    >,
    #[doc = " Adds a buffer containing the specified `data` of size `size`. Returns an ID identifying the"]
    #[doc = " new buffer. If you know the hash of the data, you can pass it in the `hash` paramter."]
    #[doc = " Otherwise, if you pass `0` for hash, the hash of the data will be computed automatically."]
    #[doc = ""]
    #[doc = " The data passed to [[add()]] must come from an [[allocate()]] call. [[add()]] will take over"]
    #[doc = " ownership of the data. You cannot reuse the data pointer for two different [[add()]] calls."]
    pub add: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            data: *const ::std::os::raw::c_void,
            size: u64,
            hash: u64,
        ) -> u32,
    >,
    #[doc = " Increases the buffer's reference count by 1. (The buffer starts at 1 after [[create()]].)"]
    pub retain: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    #[doc = " Decreases the buffer's reference count by 1. When the reference count reaches zero, the"]
    #[doc = " buffer is destroyed."]
    pub release: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    #[doc = " Returns the content of the buffer. The size is returned in `size`."]
    pub get: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *const tm_buffers_o,
            id: u32,
            size: *mut u64,
        ) -> *const ::std::os::raw::c_void,
    >,
    #[doc = " Returns the size of the buffer."]
    pub size:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u64>,
    #[doc = " Returns the hash of the buffer."]
    pub hash:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u64>,
    #[doc = " If a buffer exists with the specified hash, returns its ID. Otherwise, returns zero."]
    pub lookup:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, hash: u64) -> u32>,
    #[doc = " For debugging purposes only. Returns the reference count of the buffer."]
    pub debug__refcount:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_buffers_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffers_i>(),
        80usize,
        concat!("Size of: ", stringify!(tm_buffers_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffers_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffers_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).allocate as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(allocate)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).add as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).retain as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(retain)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).release as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(release)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).get as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).size as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).hash as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).lookup as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(lookup)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_i>())).debug__refcount as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_i),
            "::",
            stringify!(debug__refcount)
        )
    );
}
#[doc = " Manages a set of streamable buffers. Streamable buffers work as regular buffers except that they"]
#[doc = " can optionally be created with disk backing. Buffers with disk backing can be loaded on-demand or"]
#[doc = " streamed in by a background process. They can also be flushed out of main memory as necessary"]
#[doc = " (since they are backed up on disk)."]
#[doc = ""]
#[doc = " * Calling [[get()]] or [[hash()]] on a buffer that isn't loaded will on-demand load the buffer before"]
#[doc = "   the function returns. Note that this can stall the application, so you might want to pre-load"]
#[doc = "   buffers by calling [[get()]] on them in a background thread before they're actually needed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_streamable_buffers_i {
    pub __bindgen_padding_0: [u64; 10usize],
    #[doc = " Creates a streamable buffer with the content mapped to the specified region (`offset`,"]
    #[doc = " `size`) of the specified `path`. The buffer is created in \"unloaded\" state (not mapped to"]
    #[doc = " main memory). It will be loaded on demand by a subsequent [[get()]] operation. If `size` is"]
    #[doc = " zero, the size of the buffer will automatically be set from the size of the mapped file."]
    #[doc = ""]
    #[doc = " If `hash` is non-zero, the specified value is used for the hash of the data, otherwise, the"]
    #[doc = " hash is computed for the data."]
    pub map: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            path: *const ::std::os::raw::c_char,
            offset: u64,
            size: u64,
            hash: u64,
        ) -> u32,
    >,
    #[doc = " Creates a streamable buffer mapped to an asset database (see [[asset_database.h]])."]
    #[doc = ""]
    #[doc = " `hash` and `size` specify the hash and size of the buffer. The buffer is stored in a sequence"]
    #[doc = " of linked \"pages\" of size `page_size`. Pages have `page_header_size` byte header where the"]
    #[doc = " first four bytes are the index of the next page in the sequence. After the header bytes, the"]
    #[doc = " data for the page follows."]
    pub map_database: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            hash: u64,
            size: u64,
            file: *const tm_file_o,
            page_size: u32,
            page_header_size: u32,
            first_page: u32,
        ) -> u32,
    >,
    #[doc = " Returns *true* if the specified buffer is backed by file data, *false* if it only exists in"]
    #[doc = " memory."]
    pub is_mapped:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> bool>,
    #[doc = " Returns *true* if the specified buffer has been loaded into main memory, *false* if it only"]
    #[doc = " exists on disk."]
    pub is_loaded:
        ::std::option::Option<unsafe extern "C" fn(inst: *const tm_buffers_o, id: u32) -> bool>,
    #[doc = " If the `buffer` is currently loaded into main memory -- unloads it from main memory. You can"]
    #[doc = " only call this on buffers that are mapped to disk, because we need to be able to get the"]
    #[doc = " content back on-demand."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     We might need a concept of \"buffers in use\" to know when its safe to unload buffers."]
    pub unload: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, id: u32)>,
    #[doc = " Saves the content of the buffer to the specified file and offset. This creates a mapping"]
    #[doc = " between the buffer and the file."]
    pub save: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_buffers_o,
            id: u32,
            path: *const ::std::os::raw::c_char,
            offset: u64,
        ),
    >,
    #[doc = " Preloads all buffers on a background thread."]
    #[doc = " If `percentage` is not null, it will be filled continously with the current buffer loading percentage."]
    pub background_load_all:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o, percentage: *mut f32)>,
    #[doc = " Waits until all buffer data has been loaded."]
    pub ensure_all_loaded: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_buffers_o)>,
    #[doc = " Sets the IO interface to use for file access This is mostly used for testing with mock file"]
    #[doc = " systems. If `io` is `NULL`, the default file system interface ([[tm_os_api->file_system]]) will"]
    #[doc = " be used."]
    pub set_io: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_buffers_o, io: *mut tm_os_file_io_api),
    >,
}
#[test]
fn bindgen_test_layout_tm_streamable_buffers_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_streamable_buffers_i>(),
        152usize,
        concat!("Size of: ", stringify!(tm_streamable_buffers_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_streamable_buffers_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_streamable_buffers_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).map as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(map)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).map_database as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(map_database)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).is_mapped as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(is_mapped)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).is_loaded as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(is_loaded)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).unload as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(unload)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).save as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(save)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).background_load_all as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(background_load_all)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_streamable_buffers_i>())).ensure_all_loaded as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(ensure_all_loaded)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_streamable_buffers_i>())).set_io as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_streamable_buffers_i),
            "::",
            stringify!(set_io)
        )
    );
}
#[doc = " API for creating [[tm_buffers_i]] and [[tm_streamable_buffers_i]] objects."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffers_api {
    #[doc = " Creates a new buffer container."]
    pub create:
        ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i) -> *mut tm_buffers_i>,
    #[doc = " Destroys a buffer container created by [[create()]]."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(i: *mut tm_buffers_i)>,
    #[doc = " Creates a new streamable buffer container. If `io` is specified, it will be used for all file"]
    #[doc = " operations. Otherwise, [[tm_os_api->file_io]] will be used."]
    pub create_streamable: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            io: *mut tm_os_file_io_api,
        ) -> *mut tm_streamable_buffers_i,
    >,
    #[doc = " Destroys a buffer container created by [[create_streamable()]]."]
    pub destroy_streamable:
        ::std::option::Option<unsafe extern "C" fn(i: *mut tm_streamable_buffers_i)>,
}
#[test]
fn bindgen_test_layout_tm_buffers_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffers_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_buffers_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffers_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffers_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_buffers_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffers_api>())).create_streamable as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(create_streamable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffers_api>())).destroy_streamable as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffers_api),
            "::",
            stringify!(destroy_streamable)
        )
    );
}
#[doc = " Bits should be interpreted as a floating point number (64 bits means double, 32 bits means"]
#[doc = " float, 16 bits means half/float16). Floating point components are always signed."]
pub const TM_BUFFER_COMPONENT_TYPE_FLOAT: tm_buffer_component_type = 0;
#[doc = " Bits should be interpreted as a normalized integers specifying a number in the range [0 - 1]"]
#[doc = " for an unsigned component, or [-1 - 1] for a signed component."]
pub const TM_BUFFER_COMPONENT_TYPE_NORMALIZED_INTEGER: tm_buffer_component_type = 1;
#[doc = " Bits should be interpreted as an integer. If `sign` is true the integer is interpreted as a"]
#[doc = " two-complements signed integer."]
pub const TM_BUFFER_COMPONENT_TYPE_INTEGER: tm_buffer_component_type = 2;
#[doc = " Bits store depth and/or stencil values. Depth precision should be specified in `x_bits` (16,"]
#[doc = " 24 or 32 bits) If `stencil` is enabled, 8 bits should be passed in `y_bits` Note: `sign`"]
#[doc = " should always be `false`. This format will try to map to the closest available format in the"]
#[doc = " backend."]
pub const TM_BUFFER_COMPONENT_TYPE_DEPTH_STENCIL: tm_buffer_component_type = 3;
#[doc = " Describes how the bits of a component should be interpreted."]
pub type tm_buffer_component_type = ::std::os::raw::c_int;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC1_RGB: tm_buffer_compression_format = 0;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC1_RGBA: tm_buffer_compression_format = 1;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC2: tm_buffer_compression_format = 2;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC3: tm_buffer_compression_format = 3;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC4: tm_buffer_compression_format = 4;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC5: tm_buffer_compression_format = 5;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC6H_U: tm_buffer_compression_format = 6;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC6H_S: tm_buffer_compression_format = 7;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_BC7: tm_buffer_compression_format = 8;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_ETC2_RGB: tm_buffer_compression_format = 9;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_ETC2_RGBA: tm_buffer_compression_format = 10;
#[doc = " Block compression (DXT)"]
pub const TM_BUFFER_COMPRESSION_FORMAT_MAX_FORMATS: tm_buffer_compression_format = 11;
#[doc = " Describes the compression format used by a buffer."]
#[doc = ""]
#[doc = " !!! note: TODO"]
#[doc = "     Do we want to expose an interface for registering user-defined compression formats?"]
pub type tm_buffer_compression_format = ::std::os::raw::c_int;
#[doc = " Functions for encoding and decoding unique format identifiers describing the contents of a buffer or image."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_buffer_format_api {
    #[doc = " Creates a unique ID describing an uncompressed format described by:"]
    #[doc = ""]
    #[doc = " component_type"]
    #[doc = " :    The type of the components. ([[enum tm_buffer_component_type]])."]
    #[doc = " sign"]
    #[doc = " :    True if components are signed."]
    #[doc = " bits_*"]
    #[doc = " :    Number of bits in component (x, y, z, w)."]
    pub encode_uncompressed_format: ::std::option::Option<
        unsafe extern "C" fn(
            component_type: tm_buffer_component_type,
            sign: bool,
            bits_x: u8,
            bits_y: u8,
            bits_z: u8,
            bits_w: u8,
        ) -> u32,
    >,
    #[doc = " Creates a unique ID describing a compressed format. `compression_type` is one of [[enum tm_buffer_compression_format]]"]
    pub encode_compressed_format: ::std::option::Option<
        unsafe extern "C" fn(compression_type: tm_buffer_compression_format) -> u32,
    >,
    #[doc = " Returns true if the buffer is compressed. Use `decode_compression_format` to retrieve compression format."]
    pub is_compressed: ::std::option::Option<unsafe extern "C" fn(format: u32) -> bool>,
    #[doc = " Decodes an uncompressed format UID. Returns false if format is compressed. All output"]
    #[doc = " parameters are optional."]
    #[doc = ""]
    #[doc = " component_type"]
    #[doc = " :    The type of the components. ([[enum tm_buffer_component_type]])."]
    #[doc = " sign"]
    #[doc = " :    True if components are signed."]
    #[doc = " bits_*"]
    #[doc = " :    Number of bits in component (x, y, z, w)."]
    pub decode_uncompressed: ::std::option::Option<
        unsafe extern "C" fn(
            format: u32,
            component_type: *mut tm_buffer_component_type,
            sign: *mut bool,
            bits_x: *mut u8,
            bits_y: *mut u8,
            bits_z: *mut u8,
            bits_w: *mut u8,
        ) -> bool,
    >,
    #[doc = " Retrieves the compression format from a compressed format UID. Returns false if format UID is uncompressed."]
    pub decode_compression_format: ::std::option::Option<
        unsafe extern "C" fn(
            format: u32,
            compression_format: *mut tm_buffer_compression_format,
        ) -> bool,
    >,
    #[doc = " Returns total number of bits per buffer element."]
    pub bits_per_element: ::std::option::Option<unsafe extern "C" fn(format: u32) -> u32>,
    #[doc = " Returns number of components per element."]
    pub num_components: ::std::option::Option<unsafe extern "C" fn(format: u32) -> u32>,
    #[doc = " Returns a human readable format name, string allocated using temporary allocator 'ta'."]
    pub human_readable: ::std::option::Option<
        unsafe extern "C" fn(
            format: u32,
            ta: *mut tm_temp_allocator_i,
        ) -> *const ::std::os::raw::c_char,
    >,
}
#[test]
fn bindgen_test_layout_tm_buffer_format_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_buffer_format_api>(),
        64usize,
        concat!("Size of: ", stringify!(tm_buffer_format_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_buffer_format_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_buffer_format_api))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).encode_uncompressed_format as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(encode_uncompressed_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).encode_compressed_format as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(encode_compressed_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).is_compressed as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(is_compressed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).decode_uncompressed as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(decode_uncompressed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).decode_compression_format as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(decode_compression_format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).bits_per_element as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(bits_per_element)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).num_components as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(num_components)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_buffer_format_api>())).human_readable as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_buffer_format_api),
            "::",
            stringify!(human_readable)
        )
    );
}
pub const TM_CAMERA_TRANSFORM_DEFAULT: tm_camera_transform = 0;
pub const TM_CAMERA_TRANSFORM_EYE_LEFT: tm_camera_transform = 1;
pub const TM_CAMERA_TRANSFORM_EYE_RIGHT: tm_camera_transform = 2;
pub const TM_CAMERA_TRANSFORM_MAX_TRANSFORMS: tm_camera_transform = 3;
#[doc = " Describes what a camera transform represents."]
pub type tm_camera_transform = ::std::os::raw::c_int;
pub const TM_CAMERA_MODE_PERSPECTIVE: tm_camera_mode = 0;
pub const TM_CAMERA_MODE_ORTHOGRAPHIC: tm_camera_mode = 1;
pub type tm_camera_mode = ::std::os::raw::c_int;
pub const TM_CAMERA_FRUSTUM_PLANE_LEFT: tm_camera_frustum_planes = 0;
pub const TM_CAMERA_FRUSTUM_PLANE_RIGHT: tm_camera_frustum_planes = 1;
pub const TM_CAMERA_FRUSTUM_PLANE_BOTTOM: tm_camera_frustum_planes = 2;
pub const TM_CAMERA_FRUSTUM_PLANE_TOP: tm_camera_frustum_planes = 3;
pub const TM_CAMERA_FRUSTUM_PLANE_NEAR: tm_camera_frustum_planes = 4;
pub const TM_CAMERA_FRUSTUM_PLANE_FAR: tm_camera_frustum_planes = 5;
pub const TM_CAMERA_FRUSTUM_PLANE_MAX_PLANES: tm_camera_frustum_planes = 6;
pub type tm_camera_frustum_planes = ::std::os::raw::c_int;
#[doc = " Describes a camera."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_camera_t {
    pub projection: [tm_mat44_t; 3usize],
    pub view: [tm_mat44_t; 3usize],
    pub mode: tm_camera_mode,
    pub near_plane: f32,
    pub far_plane: f32,
    pub vertical_fov: f32,
    pub box_height: f32,
    pub shutter_speed: f32,
    pub aperture: f32,
    pub iso: f32,
}
#[test]
fn bindgen_test_layout_tm_camera_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_camera_t>(),
        416usize,
        concat!("Size of: ", stringify!(tm_camera_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_camera_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_camera_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).projection as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(projection)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).view as *const _ as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(view)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).mode as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).near_plane as *const _ as usize },
        388usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(near_plane)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).far_plane as *const _ as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(far_plane)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).vertical_fov as *const _ as usize },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(vertical_fov)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).box_height as *const _ as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(box_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).shutter_speed as *const _ as usize },
        404usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(shutter_speed)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).aperture as *const _ as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(aperture)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_t>())).iso as *const _ as usize },
        412usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_t),
            "::",
            stringify!(iso)
        )
    );
}
#[doc = " API for manipulating cameras."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_camera_api {
    #[doc = " Computes the view matrix from a camera's transform `tm` and stores it in `view`. Also returns `view`."]
    #[doc = ""]
    #[doc = " The return value is provided so that you can call the function and initialize a"]
    #[doc = " variable for the return value with a one-liner:"]
    #[doc = ""]
    #[doc = " ~~~c"]
    #[doc = " tm_mat44_t *view = view_from_transform(&(tm_mat44_t){0}, tm);"]
    #[doc = " ~~~"]
    pub view_from_transform: ::std::option::Option<
        unsafe extern "C" fn(view: *mut tm_mat44_t, tm: *const tm_transform_t) -> *mut tm_mat44_t,
    >,
    #[doc = " Computes the camera's transform `tm` from the `view` matrix."]
    pub transform_from_view: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            view: *const tm_mat44_t,
        ) -> *mut tm_transform_t,
    >,
    #[doc = " Computes a projection matrix `proj` from frustum bounding planes."]
    pub projection_from_frustum: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            left: f32,
            right: f32,
            bottom: f32,
            top: f32,
            near: f32,
            far: f32,
        ) -> *mut tm_mat44_t,
    >,
    #[doc = " Computes a projection matrix `proj` from near plane, far plane, FOV, and aspect."]
    pub projection_from_fov: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            near_plane: f32,
            far_plane: f32,
            vertical_fov: f32,
            aspect: f32,
        ) -> *mut tm_mat44_t,
    >,
    #[doc = " Computes an orthographic projection matrix `proj` from frustum bounding planes."]
    pub orthographic_from_frustum: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            left: f32,
            right: f32,
            bottom: f32,
            top: f32,
            near: f32,
            far: f32,
        ) -> *mut tm_mat44_t,
    >,
    #[doc = " Computes an orthographic projection matrix `proj` from near plane, far plane, width, and height."]
    pub orthographics_from_dimensions: ::std::option::Option<
        unsafe extern "C" fn(
            proj: *mut tm_mat44_t,
            near_plane: f32,
            far_plane: f32,
            width: f32,
            height: f32,
        ) -> *mut tm_mat44_t,
    >,
    #[doc = " Computes a projection matrix for the specified [[tm_camera_t]]."]
    pub projection_from_camera: ::std::option::Option<
        unsafe extern "C" fn(
            camera: *mut tm_camera_t,
            transform: tm_camera_transform,
            aspect: f32,
        ) -> *mut tm_mat44_t,
    >,
    #[doc = " Updates a free flight camera with the specified translation and rotation."]
    pub update_free_flight: ::std::option::Option<
        unsafe extern "C" fn(tm: *mut tm_transform_t, t: tm_vec3_t, r: tm_vec2_t),
    >,
    #[doc = " Updates a panning camera, panning by the specified amount. If `focus_position` is not `NULL`"]
    #[doc = " it will also pan accordingly."]
    pub update_pan: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            focus_position: *mut tm_vec3_t,
            pan: tm_vec2_t,
        ),
    >,
    #[doc = " Updates a Maya-style camera to focus on the specified position. `zoom` and `rot` specifies"]
    #[doc = " zoom and rotation amounts around the position."]
    pub update_maya: ::std::option::Option<
        unsafe extern "C" fn(
            tm: *mut tm_transform_t,
            focus_position: tm_vec3_t,
            zoom: f32,
            rot: tm_vec2_t,
        ),
    >,
    #[doc = " Converts from world coordinates to screen coordinates as seen by a camera. `transform`"]
    #[doc = " specifies which view and projection transform to use. Returns a pointer to the `screen`"]
    #[doc = " array."]
    #[doc = ""]
    #[doc = " !!! Tip"]
    #[doc = "     `screen.z` is clip space Z with near plane at 0.f and far plane at 1.f regardless"]
    #[doc = "     if engine is setup to run with reversed Z or not."]
    pub world_to_screen: ::std::option::Option<
        unsafe extern "C" fn(
            camera: *const tm_camera_t,
            transform: tm_camera_transform,
            viewport: tm_rect_t,
            world: *const tm_vec3_t,
            screen: *mut tm_vec3_t,
            n: u32,
        ) -> *mut tm_vec3_t,
    >,
    #[doc = " Does the opposite of [[world_to_screen()]] -- i.e. converts from screen coordinates back to"]
    #[doc = " world coordinates. Returns a pointer to the `world` array."]
    #[doc = ""]
    #[doc = " !!! Tip"]
    #[doc = "     `screen.z` should is clip space Z with near plane mapped to 0.f and far plane at 1.f"]
    #[doc = "     regardless if engine is setup to run with reversed Z or not."]
    pub screen_to_world: ::std::option::Option<
        unsafe extern "C" fn(
            camera: *const tm_camera_t,
            transform: tm_camera_transform,
            viewport: tm_rect_t,
            screen: *const tm_vec3_t,
            world: *mut tm_vec3_t,
            n: u32,
        ) -> *mut tm_vec3_t,
    >,
    #[doc = " Returns how many meters something needs to be in the world to become one pixel on the screen."]
    #[doc = " `distance` is the distance between the object and the camera, `vertical_fov` is the vertical"]
    #[doc = " field-of-view in radians and `viewport_height` the height of the viewport in pixels."]
    pub meters_per_pixel: ::std::option::Option<
        unsafe extern "C" fn(distance: f32, vertical_fov: f32, viewport_height: f32) -> f32,
    >,
    #[doc = " Returns the default instance of a [[tm_camera_t]]."]
    pub default_camera: ::std::option::Option<unsafe extern "C" fn() -> *const tm_camera_t>,
    #[doc = " Calculates world space frustum planes from `view` and `projection`, plane normals are pointing out of the frustum."]
    pub frustum_planes_from_view_projection: ::std::option::Option<
        unsafe extern "C" fn(
            view: *const tm_mat44_t,
            projection: *const tm_mat44_t,
            frustum_planes: *mut tm_vec4_t,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_camera_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_camera_api>(),
        120usize,
        concat!("Size of: ", stringify!(tm_camera_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_camera_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_camera_api))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).view_from_transform as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(view_from_transform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).transform_from_view as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(transform_from_view)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).projection_from_frustum as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(projection_from_frustum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).projection_from_fov as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(projection_from_fov)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).orthographic_from_frustum as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(orthographic_from_frustum)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).orthographics_from_dimensions as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(orthographics_from_dimensions)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).projection_from_camera as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(projection_from_camera)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).update_free_flight as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_free_flight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).update_pan as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_pan)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).update_maya as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(update_maya)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).world_to_screen as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(world_to_screen)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).screen_to_world as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(screen_to_world)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).meters_per_pixel as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(meters_per_pixel)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_camera_api>())).default_camera as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(default_camera)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_camera_api>())).frustum_planes_from_view_projection
                as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_camera_api),
            "::",
            stringify!(frustum_planes_from_view_projection)
        )
    );
}
#[doc = " We are not connected to any collaboration session."]
pub const TM_COLLABORATION_STATUS_DISCONNECTED: tm_collaboration_status = 0;
#[doc = " We are in the process of creating a host session."]
pub const TM_COLLABORATION_STATUS_HOST_STARTING: tm_collaboration_status = 1;
#[doc = " We are hosting a collaboration session for others to join."]
pub const TM_COLLABORATION_STATUS_HOST: tm_collaboration_status = 2;
#[doc = " We are connecting to a host."]
pub const TM_COLLABORATION_STATUS_CONNECTING: tm_collaboration_status = 3;
#[doc = " We are joined in a collaboration session hosted by someone else."]
pub const TM_COLLABORATION_STATUS_CLIENT: tm_collaboration_status = 4;
#[doc = " An error occurred somewhere."]
pub const TM_COLLABORATION_STATUS_ERROR: tm_collaboration_status = 5;
#[doc = " Status of the collaboration."]
pub type tm_collaboration_status = ::std::os::raw::c_int;
#[doc = " Callbacks called by the collaboration system."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_config_i {
    #[doc = " The truth that is synchronized during the collaboration session."]
    pub tt: *mut tm_the_truth_o,
    #[doc = " User data used for callbacks."]
    pub ud: *mut ::std::os::raw::c_void,
    #[doc = " Optional. Called when a collaboration session is started in"]
    #[doc = " [[TM_COLLABORATION_SESSION_TYPE_HOST]] mode."]
    pub host_init: ::std::option::Option<unsafe extern "C" fn(ud: *mut ::std::os::raw::c_void)>,
    #[doc = " Optional. Called when a collaboration session is started in"]
    #[doc = " [[TM_COLLABORATION_SESSION_TYPE_CLIENT]] mode."]
    pub client_init: ::std::option::Option<unsafe extern "C" fn(ud: *mut ::std::os::raw::c_void)>,
    #[doc = " Saves the initial state on the server. The saved state does not include the full buffers in"]
    #[doc = " The Truth, only their hashes. The client will load the buffers by extracting the buffer"]
    #[doc = " hashes from the state by calling [[client_buffer_hashes()]] and then send messages to the"]
    #[doc = " host to request each buffer."]
    pub host_save_state: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            carray: *mut *mut ::std::os::raw::c_char,
            a: *mut tm_allocator_i,
        ),
    >,
    #[doc = " Resets the client's Truth and returns a pointer to the new Truth. You must call this before"]
    #[doc = " calling [[client_load_state()]]."]
    pub client_reset_truth: ::std::option::Option<
        unsafe extern "C" fn(ud: *mut ::std::os::raw::c_void) -> *mut tm_the_truth_o,
    >,
    #[doc = " Decompresses the state received by the client. (The state sent by the host is compressed.)"]
    #[doc = " You need to call this before calling [[client_buffer_hashes()]] or [[client_load_state()]] on"]
    #[doc = " the state."]
    pub client_decompress_state: ::std::option::Option<
        unsafe extern "C" fn(
            app_ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
            allocator: *mut tm_allocator_i,
        ) -> *mut ::std::os::raw::c_char,
    >,
    #[doc = " Returns the buffers in the `state` received by the client. `count` receives the buffer count."]
    #[doc = " The client can use this to request the buffer contents from the host."]
    pub client_buffer_hashes: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
            count: *mut u64,
        ) -> *const u64,
    >,
    #[doc = " Loads the initial state received by the client from the server. Before calling this function,"]
    #[doc = " you must first call [[client_reset_truth()]] to reset the client's Truth. You must also load"]
    #[doc = " all the buffers in The Truth as returned by [[client_buffer_hashes()]]."]
    #[doc = ""]
    #[doc = " Returns *true* if the state was successfully loaded and *false* if there was an error loading"]
    #[doc = " the state."]
    pub client_load_state: ::std::option::Option<
        unsafe extern "C" fn(
            ud: *mut ::std::os::raw::c_void,
            state: *const ::std::os::raw::c_char,
            size: u64,
        ) -> bool,
    >,
    #[doc = " Optional. If non-zero, specifies a directory on disk that caches large buffers so that"]
    #[doc = " they don't have to be transferred over the network for the collaboration session."]
    pub cache_dir: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm_collaboration_config_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_config_i>(),
        80usize,
        concat!("Size of: ", stringify!(tm_collaboration_config_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_config_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_config_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_config_i>())).tt as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(tt)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_config_i>())).ud as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(ud)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).host_init as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(host_init)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).client_init as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(client_init)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).host_save_state as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(host_save_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).client_reset_truth as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(client_reset_truth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).client_decompress_state
                as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(client_decompress_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).client_buffer_hashes as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(client_buffer_hashes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).client_load_state as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(client_load_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_config_i>())).cache_dir as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_config_i),
            "::",
            stringify!(cache_dir)
        )
    );
}
#[doc = " The session has not yet been set-up properly."]
pub const TM_COLLABORATION_SESSION_TYPE_NONE: tm_collaboration_session_type = 0;
#[doc = " The session is for hosting."]
pub const TM_COLLABORATION_SESSION_TYPE_HOST: tm_collaboration_session_type = 1;
#[doc = " The session is for for connecting to a host."]
pub const TM_COLLABORATION_SESSION_TYPE_CLIENT: tm_collaboration_session_type = 2;
#[doc = " Describes the type (host/client) of a collaboration session."]
pub type tm_collaboration_session_type = ::std::os::raw::c_int;
#[doc = " The session has not yet been connected, or has been gracefully disconnected."]
pub const TM_COLLABORATION_SESSION_STATUS_DISCONNECTED: tm_collaboration_session_status = 0;
#[doc = " The session is currently connecting, i.e. the local client is trying to connect to a server."]
pub const TM_COLLABORATION_SESSION_STATUS_CONNECTING: tm_collaboration_session_status = 1;
#[doc = " The session is connect. This is always the value for a host."]
pub const TM_COLLABORATION_SESSION_STATUS_CONNECTED: tm_collaboration_session_status = 2;
#[doc = " Some error has occurred."]
pub const TM_COLLABORATION_SESSION_STATUS_ERROR: tm_collaboration_session_status = 3;
#[doc = " Describes the current status of a collaboration session."]
pub type tm_collaboration_session_status = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_session_o {
    _unused: [u8; 0],
}
#[doc = " Provides a layer of abstraction for collaboration. We may have multiple different implementations"]
#[doc = " of a session, such as a peer-to-peer session and a Discord session. The sessions are usually"]
#[doc = " created by some other api (see [[tm_collaboration_p2p_api]] or [[tm_collaboration_discord_api]]) and"]
#[doc = " then passed to the `host` or `connect` functions of [[tm_collaboration_api]]."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_session_i {
    pub inst: *mut tm_collaboration_session_o,
    #[doc = " Disconnects and destroys the state of the session."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    #[doc = " Returns an identifier unique for the backing library, i.e. there will be one value for a"]
    #[doc = " peer-to-peer connection and another for a Discord connection. For example, see:"]
    #[doc = " [[TM_COLLABORATION_SESSION_ARCHITECTURE__P2P]]."]
    pub architecture: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o) -> tm_strhash_t,
    >,
    #[doc = " Returns the ID of the session's host."]
    pub host_id:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o) -> u64>,
    #[doc = " Checks if any client has requested to connect to the session. If there is a waiting client,"]
    #[doc = " the function returns *true* and sets `client_id` to the ID of the client. Otherwise, returns"]
    #[doc = " *false*."]
    pub get_client_request: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: *mut u64) -> bool,
    >,
    #[doc = " Tells the session that the client with ID `client_id` has been accepted. The ID should come"]
    #[doc = " from a call to [[get_client_request()]]."]
    pub accept_client: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    #[doc = " Sends the contents of `buf` to the client with ID `client_id`. Data is buffered internally"]
    #[doc = " and is not guranteed to be actually sent until [[flush()]] is called."]
    pub send: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            client_id: u64,
            buf: *const u8,
            size: u64,
        ),
    >,
    #[doc = " Sends any queued data."]
    pub flush: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    #[doc = " Receives data and performs other session-specific per-frame actions."]
    pub update: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_collaboration_session_o)>,
    #[doc = " Returns *true* if there is incoming package data for the client with ID *client_id*. In this"]
    #[doc = " case, the data is returned in `(data, size)`. The`data` buffer is assumed to be able to hold"]
    #[doc = " all the received data. Returns *false* if there is no incoming package data for the client."]
    pub get_package_data: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            client_id: u64,
            data: *mut u8,
            size: *mut u64,
        ) -> bool,
    >,
    #[doc = " Closes the connection to client with ID `client_id`. May be used both by host and client to"]
    #[doc = " close a connection."]
    pub close_client: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    #[doc = " Sends a ping message to client with id `client_id`. This makes sure that the connection"]
    #[doc = " doesn't time-out when nothing else is happening."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Shouldn't this be handled automatically by [[update()]]?"]
    pub send_ping: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64),
    >,
    #[doc = " Returns the type of session, i.e. if it is a host or client session. May return"]
    #[doc = " [[TM_COLLABORATION_SESSION_TYPE_NONE]] if the session hasn't been set-up properly yet."]
    pub type_: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
        ) -> tm_collaboration_session_type,
    >,
    #[doc = " Returns the status of the session. For a client-session there are several possible values"]
    #[doc = " of return value type [[enum tm_collaboration_session_status]], for hosts the value will always be"]
    #[doc = " [[TM_COLLABORATION_SESSION_TYPE_HOST]]."]
    pub status: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
        ) -> tm_collaboration_session_status,
    >,
    #[doc = " Return true if client with ID `client_id` is still alive."]
    pub is_client_alive: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_collaboration_session_o, client_id: u64) -> bool,
    >,
    #[doc = " Returns *true* if the session is in the process of downloading a large data package."]
    #[doc = " In this case, the progress of the download is returned in `bytes` and `total`. Returns"]
    #[doc = " *false* if no big download is in progress."]
    pub receive_progress: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *const tm_collaboration_session_o,
            bytes: *mut u64,
            total: *mut u64,
        ) -> bool,
    >,
    #[doc = " Returns a text message into `buf`, of maximum size `max_size`, that can be used in the UI"]
    #[doc = " to provide feedback to the user about the session status."]
    pub status_message: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_collaboration_session_o,
            buf: *mut ::std::os::raw::c_char,
            max_size: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_session_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_session_i>(),
        136usize,
        concat!("Size of: ", stringify!(tm_collaboration_session_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_session_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_session_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_session_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).destroy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).architecture as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(architecture)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).host_id as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(host_id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).get_client_request as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(get_client_request)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).accept_client as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(accept_client)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_session_i>())).send as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(send)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).flush as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(flush)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).update as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).get_package_data as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(get_package_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).close_client as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(close_client)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).send_ping as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(send_ping)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).type_ as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).status as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).is_client_alive as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(is_client_alive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).receive_progress as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(receive_progress)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_session_i>())).status_message as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_session_i),
            "::",
            stringify!(status_message)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_o {
    _unused: [u8; 0],
}
#[doc = " Implements a collaboration protocol that allows changes to The Truth to be made by multiple"]
#[doc = " people on separate computers."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_api {
    #[doc = " Creates a new collaboration object."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            config: *const tm_collaboration_config_i,
        ) -> *mut tm_collaboration_o,
    >,
    #[doc = " Destroys a collaboration object created by [[create()]]."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    #[doc = " Returns the current collaboration status."]
    pub status: ::std::option::Option<
        unsafe extern "C" fn(coll: *const tm_collaboration_o) -> tm_collaboration_status,
    >,
    #[doc = " If the client is currently downloading a big data chunk, returns `true`, the number of"]
    #[doc = " `bytes` downloaded so far and the `total` number of bytes. Otherwise, returns `false`."]
    pub is_downloading: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            bytes: *mut u64,
            total: *mut u64,
        ) -> bool,
    >,
    #[doc = " Sets the Collaboration System to use the provided session for communication. All underlying"]
    #[doc = " network traffic is routed through the session. This function is called by the"]
    #[doc = " [[tm_collaboration_p2p_api->host()]] and [[tm_collaboration_p2p_api->connect()]]."]
    pub set_session: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *mut tm_collaboration_o,
            session: *const tm_collaboration_session_i,
        ),
    >,
    #[doc = " Returns the current session. The returned value is never `NULL`. If there is no current"]
    #[doc = " session, a dummy implementation is returned."]
    pub session: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o) -> *mut tm_collaboration_session_i,
    >,
    #[doc = " Disconnects from the current session, if any."]
    pub disconnect: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    #[doc = " Updates the connection as necessary -- sending and receiving data."]
    pub update: ::std::option::Option<unsafe extern "C" fn(coll: *mut tm_collaboration_o)>,
    #[doc = " Returns the identifying chat handle for this collaborator."]
    pub handle: ::std::option::Option<
        unsafe extern "C" fn(coll: *const tm_collaboration_o) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Sets a chat handle that will be used to identify this collaborator"]
    pub set_handle: ::std::option::Option<
        unsafe extern "C" fn(c: *mut tm_collaboration_o, handle: *mut ::std::os::raw::c_char),
    >,
    #[doc = " Returns the chat handle of the host."]
    pub host_handle: ::std::option::Option<
        unsafe extern "C" fn(c: *const tm_collaboration_o) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Returns the number of clients in the session."]
    pub num_clients:
        ::std::option::Option<unsafe extern "C" fn(coll: *const tm_collaboration_o) -> u32>,
    #[doc = " Returns the handle of the `i`th client."]
    pub client_handle: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            i: u32,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Returns the handle of everyone in the session."]
    pub all_handles: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            ta: *mut tm_temp_allocator_i,
        ) -> *mut *const ::std::os::raw::c_char,
    >,
    #[doc = " Sends a chat message."]
    pub send_chat: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, msg: *const ::std::os::raw::c_char),
    >,
    #[doc = " Number of chat messages in backlog."]
    pub num_chat_messages:
        ::std::option::Option<unsafe extern "C" fn(coll: *const tm_collaboration_o) -> u32>,
    #[doc = " Returns the `i`th message in the chat backlog, together with the name of the sender."]
    pub chat_message: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *const tm_collaboration_o,
            i: u32,
            sender: *mut *const ::std::os::raw::c_char,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Call this if a complete resynchronization of the state from the host is needed. `tt` is the"]
    #[doc = " new Truth object for the host."]
    pub resynchronize_state: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, tt: *mut tm_the_truth_o),
    >,
    #[doc = " For testing purposes. Sends `num` packages of `size` to all peers. The recieving peers will"]
    #[doc = " print how long it took for them to receive the packages."]
    pub send_test_packages: ::std::option::Option<
        unsafe extern "C" fn(coll: *mut tm_collaboration_o, size: u64, num: u32),
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_api>(),
        152usize,
        concat!("Size of: ", stringify!(tm_collaboration_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).status as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).is_downloading as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(is_downloading)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).set_session as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(set_session)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).session as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(session)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).disconnect as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(disconnect)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).update as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).handle as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).set_handle as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(set_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).host_handle as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(host_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).num_clients as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(num_clients)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).client_handle as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(client_handle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).all_handles as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(all_handles)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_api>())).send_chat as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(send_chat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).num_chat_messages as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(num_chat_messages)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).chat_message as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(chat_message)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).resynchronize_state as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(resynchronize_state)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_api>())).send_test_packages as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_api),
            "::",
            stringify!(send_test_packages)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_p2p_o {
    _unused: [u8; 0],
}
#[doc = " Represents a host that was discovered on the LAN."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_discovered_host_t {
    #[doc = " Address of the host."]
    pub address: *const tm_socket_address_t,
    #[doc = " Name of the host (handle of host user)."]
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm_collaboration_discovered_host_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_discovered_host_t>(),
        16usize,
        concat!("Size of: ", stringify!(tm_collaboration_discovered_host_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_discovered_host_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_collaboration_discovered_host_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_discovered_host_t>())).address as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_discovered_host_t),
            "::",
            stringify!(address)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_discovered_host_t>())).name as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_discovered_host_t),
            "::",
            stringify!(name)
        )
    );
}
#[doc = " This API creates instances of [[tm_collaboration_session_i]] for hosting and connecting"]
#[doc = " peer-to-peer collaboration sessions. It also takes care of LAN host discovery."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_collaboration_p2p_api {
    #[doc = " Creates the P2P collaboration interface object. Typically, you call this during"]
    #[doc = " application startup, so you can call [[update()]] in the tick loop to discover"]
    #[doc = " any new hosts on the LAN."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            coll: *mut tm_collaboration_o,
            allocator: *mut tm_allocator_i,
        ) -> *mut tm_collaboration_p2p_o,
    >,
    #[doc = " Destroys the P2P collaboration interface object created by [[create()]]. Typically,"]
    #[doc = " you call this during application shutdown."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o)>,
    #[doc = " Updates the LAN host discovery, to detect any new collaboration hosts on the network."]
    #[doc = " Typically, you call this in the application's tick loop, whether the collaboration tab is open"]
    #[doc = " or not."]
    pub update: ::std::option::Option<unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o)>,
    #[doc = " Creates a session for hosting peer-to-peer collaboration on the specified `port`. If `port`"]
    #[doc = " is zero, a random port will be assigned. This function calls the[[host()]] function of"]
    #[doc = " [[tm_collaboration_api]] to set the session up."]
    pub host: ::std::option::Option<
        unsafe extern "C" fn(coll_p2p: *mut tm_collaboration_p2p_o, port: u32, use_upnp: bool),
    >,
    #[doc = " Creates a client peer-to-peer collaboration session, connecting to the collaboration host at"]
    #[doc = " `address`. Calls the [[connect()]] function in [[tm_collaboration_api]] to set the session up."]
    pub connect: ::std::option::Option<
        unsafe extern "C" fn(
            coll_p2p: *mut tm_collaboration_p2p_o,
            address: *const tm_socket_address_t,
        ),
    >,
    #[doc = " Returns the hosts discovered on the LAN. The return value is the total number of hosts"]
    #[doc = " found. The function also stores as many of these as it can fit into the array `hosts`"]
    #[doc = " of size `max_hosts`."]
    pub discovered_lan_hosts: ::std::option::Option<
        unsafe extern "C" fn(
            coll_p2p: *const tm_collaboration_p2p_o,
            hosts: *mut tm_collaboration_discovered_host_t,
            max_hosts: u32,
        ) -> u32,
    >,
}
#[test]
fn bindgen_test_layout_tm_collaboration_p2p_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_collaboration_p2p_api>(),
        48usize,
        concat!("Size of: ", stringify!(tm_collaboration_p2p_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_collaboration_p2p_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_collaboration_p2p_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).destroy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).update as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).host as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(host)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).connect as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(connect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_collaboration_p2p_api>())).discovered_lan_hosts as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_collaboration_p2p_api),
            "::",
            stringify!(discovered_lan_hosts)
        )
    );
}
pub const TM_CONFIG_TYPE_NULL: tm_config_type = 0;
pub const TM_CONFIG_TYPE_FALSE: tm_config_type = 1;
pub const TM_CONFIG_TYPE_TRUE: tm_config_type = 2;
pub const TM_CONFIG_TYPE_NUMBER: tm_config_type = 3;
pub const TM_CONFIG_TYPE_STRING: tm_config_type = 4;
pub const TM_CONFIG_TYPE_ARRAY: tm_config_type = 5;
pub const TM_CONFIG_TYPE_OBJECT: tm_config_type = 6;
#[doc = " Types supported in the system."]
pub type tm_config_type = ::std::os::raw::c_int;
#[doc = " Represents a config item."]
#[doc = ""]
#[doc = " Config files are stored in big binary data blocks. Each item in the config file appears at a"]
#[doc = " particular offset in that data block and ca be uniquely identified by its `type`"]
#[doc = " ([[enum tm_config_type]])  and `offset`."]
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_item_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[test]
fn bindgen_test_layout_tm_config_item_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_item_t>(),
        4usize,
        concat!("Size of: ", stringify!(tm_config_item_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_item_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_config_item_t))
    );
}
impl tm_config_item_t {
    #[inline]
    pub fn type_(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn offset(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_offset(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(type_: u32, offset: u32) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let type_: u32 = unsafe { ::std::mem::transmute(type_) };
            type_ as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let offset: u32 = unsafe { ::std::mem::transmute(offset) };
            offset as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_o {
    _unused: [u8; 0],
}
#[doc = " Represents a free form \"configuration\" structure that can represent JSON-like data."]
#[doc = ""]
#[doc = " The structure uses a single memory buffer internally to represent all the data. While it has a"]
#[doc = " read/write interface, it does not try to reclaim deleted or unreferenced data, so it is not"]
#[doc = " suitable for situations where the data mutates constantly. Instead, it is intended for a typical"]
#[doc = " \"configuration file\" use case where the data first goes through a *construction* phase (for"]
#[doc = " example parsing it from a JSON file) and then a *query* phase where the data is being used."]
#[doc = ""]
#[doc = " Use cases very different from this, for example string data that mutates every frame, can cause"]
#[doc = " unbounded memory growth."]
#[doc = ""]
#[doc = " Using the `copy` function to copy the data to a fresh [[tm_config_i]] object will pack the data and"]
#[doc = " get rid of unreferenced items."]
#[doc = ""]
#[doc = " !!! TIP: Numeric type"]
#[doc = "     Similar to JavaScript, 64-bit doubles are used to represent all numbers in the file."]
#[doc = "     This means that it cannot accurately represent 64-bit integers. (32-bit integers can"]
#[doc = "     be accurately represented by a 64-bit double.) To store 64-bit integers in the config"]
#[doc = "     object you have to resort to other means (such as using a string representation)."]
#[doc = ""]
#[doc = " !!! TODO: API-REVIEW"]
#[doc = "     The functions here should be moved to a [[tm_config_api]] API. There is no reason to use"]
#[doc = "     an interface type, since we only have a single implementation and don't expect that to"]
#[doc = "     change."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_i {
    pub inst: *mut tm_config_o,
    #[doc = " Returns the root object of the config tree."]
    pub root:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o) -> tm_config_item_t>,
    #[doc = " Returns the specified `item` as number. If the item type is not [[TM_CONFIG_TYPE_NUMBER]],"]
    #[doc = " this returns `0.0`."]
    pub to_number: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_config_o, item: tm_config_item_t) -> f64,
    >,
    #[doc = " Returns the specified `item` as string. If the item type is not [[TM_CONFIG_TYPE_STRING]],"]
    #[doc = " this returns `\"\"`."]
    pub to_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
        ) -> *const ::std::os::raw::c_char,
    >,
    #[doc = " Retrieves the items of a [[TM_CONFIG_TYPE_ARRAY]]. The function will return the number of"]
    #[doc = " items in the array, and a pointer to the array in the `items` parameter. If the item type is"]
    #[doc = " not [[TM_CONFIG_TYPE_ARRAY]], this returns an empty array."]
    #[doc = ""]
    #[doc = " The returned array is invalidated if you add new data to the config structure."]
    pub to_array: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
            items: *mut *mut tm_config_item_t,
        ) -> u32,
    >,
    #[doc = " Retrieves the keys and values of a [[TM_CONFIG_TYPE_OBJECT]]. The function will return the"]
    #[doc = " number of items in the object, a pointer to the keys in `keys`, and a pointer to the values"]
    #[doc = " in `values`. If the item type is not [[TM_CONFIG_TYPE_OBJECT]], this returns an empty object."]
    #[doc = ""]
    #[doc = " The returned arrays are invalidated if you add new data to the config structure."]
    pub to_object: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            item: tm_config_item_t,
            keys: *mut *mut tm_config_item_t,
            values: *mut *mut tm_config_item_t,
        ) -> u32,
    >,
    #[doc = " Adds a new number to the config and returns a reference to it."]
    pub add_number: ::std::option::Option<
        unsafe extern "C" fn(inst: *mut tm_config_o, n: f64) -> tm_config_item_t,
    >,
    #[doc = " Adds a new string to the config and returns a reference to it."]
    pub add_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            s: *const ::std::os::raw::c_char,
        ) -> tm_config_item_t,
    >,
    #[doc = " Adds a new array to the config with the specified list of items in it."]
    pub add_array: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            items: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    #[doc = " Adds a new object to the config with the specified list of keys and values."]
    pub add_object: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            keys: *const tm_config_item_t,
            values: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    #[doc = " Convenience version of [[add_object()]] that calls [[add_string()]] on all the `keys`"]
    #[doc = " automatically before creating the object."]
    pub add_object_with_string_keys: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            keys: *mut *const ::std::os::raw::c_char,
            values: *const tm_config_item_t,
            size: u32,
        ) -> tm_config_item_t,
    >,
    #[doc = " Sets the `i`th element of `array` to `item`. `i` must be within the range"]
    #[doc = " of indices of the array."]
    pub array_set: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            array: tm_config_item_t,
            i: u32,
            item: tm_config_item_t,
        ),
    >,
    #[doc = " Pushes `item` to the end of the array."]
    pub array_push: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            array: tm_config_item_t,
            item: tm_config_item_t,
        ),
    >,
    #[doc = " Gets the value of the `object` key `key_hash`. `key_hash` should be the"]
    #[doc = " [[tm_murmur_hash_string()]] of the key string you are querying for. If the"]
    #[doc = " key doesn't exist in the object, [[tm_config_api->c_null]] will be returned."]
    pub object_get: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key_hash: tm_strhash_t,
        ) -> tm_config_item_t,
    >,
    #[doc = " Updates the value of the `object` key `key_hash` to `value`. If `key_hash`"]
    #[doc = " does not exist in the object, this function is a NOP. You must use"]
    #[doc = " `object_add` to add new keys."]
    pub object_update: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key_hash: tm_strhash_t,
            value: tm_config_item_t,
        ),
    >,
    #[doc = " If the key `key` exists in the object, its value will be updated to"]
    #[doc = " `value`. Otherwise, it will be added to the object."]
    pub object_add: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            key: *const ::std::os::raw::c_char,
            value: tm_config_item_t,
        ),
    >,
    #[doc = " Sets the root of the config tree to `root`."]
    pub set_root:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o, root: tm_config_item_t)>,
    #[doc = " Copies the entire tree from `src` to `dst`. Unreferenced data in `src`"]
    #[doc = " will not be copied."]
    pub copy:
        ::std::option::Option<unsafe extern "C" fn(dst: *mut tm_config_o, src: *mut tm_config_o)>,
    #[doc = " Returns the allocator of the config object."]
    pub allocator:
        ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_config_o) -> *mut tm_allocator_i>,
    #[doc = " Validates the child keys of the specified object, logs any unknown children."]
    #[doc = " Returns whether any errors were found."]
    pub validate_object: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_config_o,
            object: tm_config_item_t,
            object_display_name: *const ::std::os::raw::c_char,
            valid_child_keys: *mut *const ::std::os::raw::c_char,
            num_valid_child_keys: u32,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_config_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_i>(),
        160usize,
        concat!("Size of: ", stringify!(tm_config_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_config_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).root as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_number as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_string as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_array as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).to_object as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(to_object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_number as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_string as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_string)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_array as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_array)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).add_object as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_object)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_config_i>())).add_object_with_string_keys as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(add_object_with_string_keys)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).array_set as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(array_set)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).array_push as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(array_push)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_get as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_get)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_update as *const _ as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).object_add as *const _ as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(object_add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).set_root as *const _ as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(set_root)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).copy as *const _ as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).allocator as *const _ as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(allocator)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_i>())).validate_object as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_i),
            "::",
            stringify!(validate_object)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_config_api {
    #[doc = " Creates a new config object."]
    pub create:
        ::std::option::Option<unsafe extern "C" fn(a: *mut tm_allocator_i) -> *mut tm_config_i>,
    #[doc = " Destroys a config object created by [[create()]]."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(cdi: *mut tm_config_i)>,
    #[doc = " The `null` item."]
    pub c_null: tm_config_item_t,
    #[doc = " The `false` item."]
    pub c_false: tm_config_item_t,
    #[doc = " The `true` item."]
    pub c_true: tm_config_item_t,
    pub _padding_182: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_config_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_config_api>(),
        32usize,
        concat!("Size of: ", stringify!(tm_config_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_config_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_config_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_null as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_null)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_false as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_false)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>())).c_true as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(c_true)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_config_api>()))._padding_182 as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_config_api),
            "::",
            stringify!(_padding_182)
        )
    );
}
#[doc = " If you open a project and this asset is missing -- it will be created."]
pub const TM_CORE_CREATE_POLICY__CREATE: tm_core_create_policy = 0;
#[doc = " If you open a project and this asset exists -- it will be removed. This can be used to"]
#[doc = " delete old/deprecated core assets."]
pub const TM_CORE_CREATE_POLICY__REMOVE: tm_core_create_policy = 1;
#[doc = " The asset will neither be created or removed."]
pub const TM_CORE_CREATE_POLICY__IGNORE: tm_core_create_policy = 2;
#[doc = " Policy value that controls if the asset should be created if a project is opened and the asset"]
#[doc = " is missing. Can also be used to explicitly remove old/deprecated assets."]
pub type tm_core_create_policy = ::std::os::raw::c_int;
#[doc = " Interface used to define a core asset."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_asset_i {
    #[doc = " Hashed string ID that uniquely identifies the core asset. This is used to determine if the"]
    #[doc = " asset already exists in the project or if it needs to be created."]
    pub core_id: tm_strhash_t,
    #[doc = " Default path in the asset browser where this asset will be created. Typically this path"]
    #[doc = " should start with `core/`. The path should include the file name but not the extension (this"]
    #[doc = " is set automatically based on the resource type)."]
    #[doc = ""]
    #[doc = " Note that users may move/rename core assets in their projects and we will still be able to"]
    #[doc = " track them (through their Core IDs)."]
    pub path: *const ::std::os::raw::c_char,
    #[doc = " Policy object that determines when the asset should be created/destroyed."]
    pub create_policy: tm_core_create_policy,
    pub _padding_61: [::std::os::raw::c_char; 4usize],
    #[doc = " Current version of the core asset. Whenever you make changes to the asset that is shipped"]
    #[doc = " with the engine, you should increase this version number so that [[update()]] can get called"]
    #[doc = " properly."]
    pub version: u64,
    #[doc = " User-data that is passed along to `create` and `update`. Useful when data-driving the"]
    #[doc = " creation of assets. See `core_importer.c` for an example."]
    pub user_data: *const ::std::os::raw::c_void,
    #[doc = " Called by [[tm_core_api]] to create the asset in the project. Returns the ID of the created"]
    #[doc = " object in The Truth."]
    #[doc = ""]
    #[doc = " !!! note"]
    #[doc = "     This function should return the content/data of the asset. [[tm_core_api]] will"]
    #[doc = "     automatically wrap it in a [[TM_TT_TYPE__ASSET]] object to create an asset out of it."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            user_data: *const ::std::os::raw::c_void,
        ) -> tm_tt_id_t,
    >,
    #[doc = " Optional. Called to update the core asset when the project is loaded."]
    #[doc = ""]
    #[doc = " When a project is loaded and the `version` of a [[tm_core_asset_i]] is greater than the stored"]
    #[doc = " version in the project, [[update()]] will be called to update the asset in the project."]
    #[doc = ""]
    #[doc = " `data_id` is the Truth ID of the asset's content/data and `old_version` is the old version"]
    #[doc = " number that was stored in the file. It is up to the [[update()]] function to decide what to do."]
    #[doc = " It might overwrite user changes, try to merge them with changes made in the engine, etc."]
    pub update: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            data_id: tm_tt_id_t,
            old_version: u64,
            user_data: *const ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Optional. Called whenever an asset has been created or updated, after the data object of"]
    #[doc = " the asset has been wrapped in a [[TM_TT_TYPE__ASSET]]. The owner of `data_id` is guaranteed"]
    #[doc = " to be this asset. This can be used for patching up the asset with for example asset labels."]
    pub on_change: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            data_id: tm_tt_id_t,
            user_data: *const ::std::os::raw::c_void,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_core_asset_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_asset_i>(),
        64usize,
        concat!("Size of: ", stringify!(tm_core_asset_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_asset_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_asset_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).core_id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(core_id)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).path as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).create_policy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(create_policy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>()))._padding_61 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(_padding_61)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).version as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).user_data as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(user_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).create as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).update as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_asset_i>())).on_change as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_asset_i),
            "::",
            stringify!(on_change)
        )
    );
}
#[doc = " Used for the result of [[tm_core_api->update()]]."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_update_result_t {
    #[doc = " A carray of assets that were created as part of the update operation."]
    #[doc = "* carray */"]
    pub created_assets: *mut tm_tt_id_t,
    #[doc = " A carray of assets that were removed as part of the update operation."]
    #[doc = "* carray */"]
    pub removed_assets: *mut tm_tt_id_t,
    #[doc = " A carray of assets that were updated as part of the update operation."]
    #[doc = "* carray */"]
    pub updated_assets: *mut tm_tt_id_t,
}
#[test]
fn bindgen_test_layout_tm_core_update_result_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_update_result_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_update_result_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_update_result_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_update_result_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).created_assets as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(created_assets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).removed_assets as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(removed_assets)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_update_result_t>())).updated_assets as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_update_result_t),
            "::",
            stringify!(updated_assets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_api {
    #[doc = " Creates the core assets in The Truth `tt`. This is called when a new Truth project is"]
    #[doc = " created."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(tt: *mut tm_the_truth_o, asset_root_id: tm_tt_id_t),
    >,
    #[doc = " Updates the core assets in The Truth `tt`. This is called when a Truth project is opened."]
    pub update: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            asset_root_id: tm_tt_id_t,
            ta: *mut tm_temp_allocator_i,
        ) -> tm_core_update_result_t,
    >,
    #[doc = " Locates the core asset with the specified `core_id` and returns its ID in The Truth. Returns"]
    #[doc = " 0 if `tt` doesn't contain the asset. Note that this function returns the ID of the `DATA`"]
    #[doc = " object, the corresponding `ASSET` object is its owner."]
    pub locate_asset: ::std::option::Option<
        unsafe extern "C" fn(
            tt: *mut tm_the_truth_o,
            asset_root_id: tm_tt_id_t,
            core_id: tm_strhash_t,
        ) -> tm_tt_id_t,
    >,
}
#[test]
fn bindgen_test_layout_tm_core_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).update as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_api>())).locate_asset as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_api),
            "::",
            stringify!(locate_asset)
        )
    );
}
#[doc = " Defines an asset to import from the core project."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_asset_t {
    #[doc = " Will be used as `core_id` when this is translated into a [[tm_core_asset_i]]. Use something"]
    #[doc = " that is static between sessions, such as a TM_STATIC_HASH."]
    pub id: tm_strhash_t,
    #[doc = " The version of the asset, needs to be manually bumped whenever the asset is changed on disk."]
    pub version: u64,
    #[doc = " The path to the asset within the core project."]
    pub path: *const ::std::os::raw::c_char,
    #[doc = " The creation policy, see [[enum tm_core_create_policy]]. Set to"]
    #[doc = " [[TM_CORE_CREATE_POLICY__REMOVE]] when a core asset has been deleted in the core project,"]
    #[doc = " this will trigger a delete in the user project as well."]
    pub create_policy: u32,
    pub _padding_50: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout_tm_core_importer_asset_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_importer_asset_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_core_importer_asset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_importer_asset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_importer_asset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_asset_t>())).id as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>())).version as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_asset_t>())).path as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(path)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>())).create_policy as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(create_policy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_asset_t>()))._padding_50 as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_asset_t),
            "::",
            stringify!(_padding_50)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_state_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_core_importer_api {
    #[doc = " Creates a core importer for importing/updating the core project found at `core_project_path`"]
    #[doc = " into The Truth `user_tt` with asset root `user_asset_root`."]
    #[doc = ""]
    #[doc = " `output_path` is the path in the `user_tt` project where imported core assets will be stored."]
    #[doc = ""]
    #[doc = " In order to actually import the assets, you first need to register them with the"]
    #[doc = " [[tm_core_api]] system by calling [[register_assets()]] and then call [[tm_core_api->create()]] or"]
    #[doc = " [[tm_core_api->update()]]. Only the assets that are explicitly registered in the"]
    #[doc = " [[register_assets()]] call will be imported."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            user_tt: *mut tm_the_truth_o,
            user_asset_root: tm_tt_id_t,
            core_project_path: *const ::std::os::raw::c_char,
            output_path: *const ::std::os::raw::c_char,
        ) -> *mut tm_core_importer_state_o,
    >,
    #[doc = " Destroys a core importer created by [[create()]]."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(state: *mut tm_core_importer_state_o)>,
    #[doc = " Registers imported core assets with [[tm_core_api]]."]
    #[doc = ""]
    #[doc = " `to_register` is an array describing the imported assets to register. The assets will be"]
    #[doc = " registered using the [[TM_CORE_ASSET_INTERFACE_NAME]] interface in [[core.h]], making them"]
    #[doc = " visible to [[tm_core_api->create()]] and [[tm_core_api->update()]]."]
    pub register_assets: ::std::option::Option<
        unsafe extern "C" fn(
            state: *mut tm_core_importer_state_o,
            to_register: *const tm_core_importer_asset_t,
            num_to_register: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_core_importer_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_core_importer_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_core_importer_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_core_importer_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_core_importer_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_core_importer_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_core_importer_api>())).register_assets as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_core_importer_api),
            "::",
            stringify!(register_assets)
        )
    );
}
#[doc = " Result of the [[can_recover()]] function."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_can_recover_result_t {
    #[doc = " Non-zero if there is recovery data to use. The `data` is allocated with the temp allocator"]
    #[doc = " `ta` passed to the [[can_recover()]] function."]
    pub data: *const ::std::os::raw::c_char,
    pub data_bytes: u32,
    pub _padding_24: [::std::os::raw::c_char; 4usize],
    #[doc = " Pointer to the original project file that we are recovering from, or NULL if we are"]
    #[doc = " recovering from a blank project. The project data from this file should be loaded before"]
    #[doc = " calling [[recover()]], since the recovery data is a delta from the project data."]
    pub project: *const ::std::os::raw::c_char,
    #[doc = " Pointer to the UUID of the root object in the crash recovery data. This is useful when"]
    #[doc = " recovering from a blank project. You want to make sure that the UUID of your root object"]
    #[doc = " matches the one in the crash recovery data, so that anything added to the root in the crash"]
    #[doc = " recovery ends up in your project."]
    #[doc = ""]
    #[doc = " Note: If you are not recovering from a blank project, the root UUID will automatically be"]
    #[doc = " correct, since it is loaded from the project data."]
    pub root: *const tm_uuid_t,
}
#[test]
fn bindgen_test_layout_tm_crash_recovery_can_recover_result_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_crash_recovery_can_recover_result_t>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(tm_crash_recovery_can_recover_result_t)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<tm_crash_recovery_can_recover_result_t>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(tm_crash_recovery_can_recover_result_t)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).data as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).data_bytes
                as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(data_bytes)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>()))._padding_24
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(_padding_24)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).project as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(project)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_can_recover_result_t>())).root as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_can_recover_result_t),
            "::",
            stringify!(root)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_o {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_crash_recovery_api {
    #[doc = " Creates a crash recovery system for The Truth `tt`. `recovery_path` is the path that will be"]
    #[doc = " used for the crash recovery file."]
    pub create: ::std::option::Option<
        unsafe extern "C" fn(
            a: *mut tm_allocator_i,
            recovery_path: *const ::std::os::raw::c_char,
        ) -> *mut tm_crash_recovery_o,
    >,
    #[doc = " Destroys the crash recovery system. Calling this function is considered a \"clean shutdown\" of"]
    #[doc = " the recovery system and will delete the recovery file."]
    #[doc = ""]
    #[doc = " The presence of a recovery file is indication that the shutdown was not \"clean\". This is used"]
    #[doc = " by [[can_recover()]] to return the state of the recovery system."]
    pub destroy: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    #[doc = " Starts recording crash recovery data for the specified `project` file. If `project` is"]
    #[doc = " `NULL`, starts recording data for a new empty project. `root` should be the ID of the    root"]
    #[doc = " object in The Truth."]
    #[doc = ""]
    #[doc = " Calling [[start_recording()]] will erase any previously created crash recording file."]
    pub start_recording: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            project: *const ::std::os::raw::c_char,
            tt: *mut tm_the_truth_o,
            root: tm_tt_id_t,
        ),
    >,
    #[doc = " Stops recording crash recovery data and deletes the recovery file."]
    pub stop_recording: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    #[doc = " Updates the crash recovery system. If a recording is in progress, the latest changes will be"]
    #[doc = " appended to the crash recovery file."]
    pub update: ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
    #[doc = " Checks if there is any crash recovery data to recover and returns the result. You would"]
    #[doc = " typically call this at start of an editor to check if there is any data left from a previous"]
    #[doc = " session and if so, prompt the user to recover the data."]
    pub can_recover: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            ta: *mut tm_temp_allocator_i,
        ) -> tm_crash_recovery_can_recover_result_t,
    >,
    #[doc = " Uses the recovery file to recover unsaved changes to The Truth `tt`."]
    #[doc = ""]
    #[doc = " !!! NOTE"]
    #[doc = "     [[recover()]] will only apply the delta changes saved in the recovery file, not load the"]
    #[doc = "     original project. It is the responsibility of the caller to load the original project"]
    #[doc = "     data from the project file returned by [[can_recover()]] before calling [[recover()]]."]
    pub recover: ::std::option::Option<
        unsafe extern "C" fn(
            cr: *mut tm_crash_recovery_o,
            rd: tm_crash_recovery_can_recover_result_t,
            tt: *mut tm_the_truth_o,
        ),
    >,
    #[doc = " Deletes the crash recovery physical file, if any."]
    pub delete_physical_file:
        ::std::option::Option<unsafe extern "C" fn(cr: *mut tm_crash_recovery_o)>,
}
#[test]
fn bindgen_test_layout_tm_crash_recovery_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_crash_recovery_api>(),
        64usize,
        concat!("Size of: ", stringify!(tm_crash_recovery_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_crash_recovery_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_crash_recovery_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).create as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(create)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).start_recording as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(start_recording)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).stop_recording as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(stop_recording)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).update as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(update)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).can_recover as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(can_recover)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_crash_recovery_api>())).recover as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(recover)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_crash_recovery_api>())).delete_physical_file as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_crash_recovery_api),
            "::",
            stringify!(delete_physical_file)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_o {
    _unused: [u8; 0],
}
#[doc = " Interface for error handling."]
#[doc = ""]
#[doc = " Application errors will be reported to this interface. It is up to the interface to decide"]
#[doc = " how to deal with them."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_i {
    pub inst: *mut tm_error_o,
    #[doc = " Reports an error at the specified `file` and `line` of the code. The error message should be"]
    #[doc = " a verbose enough description of the error that someone who reads the error message can"]
    #[doc = " diagnose and fix the problem."]
    pub errorf: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_error_o,
            file: *const ::std::os::raw::c_char,
            line: u32,
            format: *const ::std::os::raw::c_char,
            ...
        ),
    >,
    #[doc = " As [[errorf()]], but used to report a fatal error."]
    #[doc = ""]
    #[doc = " This is called whenever a \"fatal\" error occurs -- an error so serious that there is no possible"]
    #[doc = " way the engine can continue running. (When a normal error occur, the engine tries to keep"]
    #[doc = " running to give the user a chance to save their data.)"]
    #[doc = ""]
    #[doc = " [[fatal()]] is typically called by the [[TM_FATAL_ASSERT()]] macro. Note that this macro calls"]
    #[doc = " [[errorf()]] first, so [[fatal()]] does not have to repeat the logging that [[errorf()]] does, but"]
    #[doc = " it might want to show a more prominent error, such as an error dialog box, before shutting"]
    #[doc = " down the application."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     For consistency, this function should be called `fatalf()`."]
    pub fatal: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_error_o,
            file: *const ::std::os::raw::c_char,
            line: u32,
            format: *const ::std::os::raw::c_char,
            ...
        ),
    >,
}
#[test]
fn bindgen_test_layout_tm_error_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_error_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_error_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_error_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_error_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).errorf as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(errorf)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_i>())).fatal as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_i),
            "::",
            stringify!(fatal)
        )
    );
}
#[doc = " Structure used by [[tm_error_api->create_record_handler()]] to record error messages. In addition"]
#[doc = " to recording the errors in the `errors` array, this handler also passes them on to the `backing`"]
#[doc = " error handler (if it is non-zero)."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_record_t {
    pub ta: *mut tm_temp_allocator_i,
    #[doc = " carray"]
    pub errors: *mut *mut ::std::os::raw::c_char,
    pub backing: *mut tm_error_i,
}
#[test]
fn bindgen_test_layout_tm_error_record_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_error_record_t>(),
        24usize,
        concat!("Size of: ", stringify!(tm_error_record_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_error_record_t>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_error_record_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_record_t>())).ta as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_record_t),
            "::",
            stringify!(ta)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_record_t>())).errors as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_record_t),
            "::",
            stringify!(errors)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_record_t>())).backing as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_record_t),
            "::",
            stringify!(backing)
        )
    );
}
#[doc = " API for error handling. This API provides a number of default error handlers."]
#[doc = ""]
#[doc = " !!! TIP"]
#[doc = "     In addition to the error handlers defined here, you can also create your own error"]
#[doc = "     handler. You can use this for example to implement a unit test that tests that a"]
#[doc = "     certain action produces an expected error."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_error_api {
    #[doc = " Basic error handler that just logs the error messages using [[tm_logger_api->print()]]. Fatal"]
    #[doc = " errors are shown in a dialog box using [[tm_os_dialogs_api->message_box()]]."]
    pub log: *mut tm_error_i,
    #[doc = " Default error handler. This can be used by systems that for one reason or another don't want"]
    #[doc = " to take an explicit [[tm_error_i]] argument."]
    #[doc = ""]
    #[doc = " Assign this value to change the default error handler. By default, this is mapped to the"]
    #[doc = " `log` error handler."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Currently, a lot of system just use the default error handler. We should update them"]
    #[doc = "     to expose the error handler as an argument, so that the caller can get detailed"]
    #[doc = "     control over how errors are handled."]
    pub def: *mut tm_error_i,
    #[doc = " Creates an error handler that stores all the encountered error messages in the `mem`"]
    #[doc = " structure. In addition, it also passes along the errors to `mem->backing` (if non-zero)."]
    pub create_record_handler:
        ::std::option::Option<unsafe extern "C" fn(mem: *mut tm_error_record_t) -> tm_error_i>,
}
#[test]
fn bindgen_test_layout_tm_error_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_error_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_error_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_error_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_error_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_api>())).log as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_api),
            "::",
            stringify!(log)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_error_api>())).def as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_api),
            "::",
            stringify!(def)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_error_api>())).create_record_handler as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_error_api),
            "::",
            stringify!(create_record_handler)
        )
    );
}
#[doc = " API for querying and setting feature flags."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_feature_flags_api {
    #[doc = " Returns true if the specified feature flag is enabled."]
    pub enabled: ::std::option::Option<unsafe extern "C" fn(flag: tm_strhash_t) -> bool>,
    #[doc = " Enables or disables the specified feature flag."]
    pub set_enabled: ::std::option::Option<unsafe extern "C" fn(flag: tm_strhash_t, enabled: bool)>,
    #[doc = " Returns a list of all enabled feature flags. `count` returns the number of items in the list."]
    pub all_enabled:
        ::std::option::Option<unsafe extern "C" fn(count: *mut u32) -> *const tm_strhash_t>,
}
#[test]
fn bindgen_test_layout_tm_feature_flags_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_feature_flags_api>(),
        24usize,
        concat!("Size of: ", stringify!(tm_feature_flags_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_feature_flags_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_feature_flags_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_feature_flags_api>())).enabled as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_feature_flags_api>())).set_enabled as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(set_enabled)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_feature_flags_api>())).all_enabled as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_feature_flags_api),
            "::",
            stringify!(all_enabled)
        )
    );
}
#[doc = " API for querying for `gitignore` patterns."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_git_ignore_api {
    #[doc = " Returns *true* if one of the `patterns` matches the `path` (i.e., the `gitignore` file"]
    #[doc = " specifies that the `path` should be ignored)."]
    #[doc = ""]
    #[doc = " `patterns` should use the [gitignore](https://git-scm.com/docs/gitignore) syntax, for example"]
    #[doc = " the content of a `.gitignore` file."]
    pub match_: ::std::option::Option<
        unsafe extern "C" fn(
            patterns: *const ::std::os::raw::c_char,
            path: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_git_ignore_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_git_ignore_api>(),
        8usize,
        concat!("Size of: ", stringify!(tm_git_ignore_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_git_ignore_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_git_ignore_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_git_ignore_api>())).match_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_git_ignore_api),
            "::",
            stringify!(match_)
        )
    );
}
#[doc = " Image is one dimensional."]
pub const TM_IMAGE_TYPE_1D: tm_image_type = 0;
#[doc = " Image is two dimensional."]
pub const TM_IMAGE_TYPE_2D: tm_image_type = 1;
#[doc = " Image is three dimensional / volume."]
pub const TM_IMAGE_TYPE_3D: tm_image_type = 2;
#[doc = " Image is a cube map."]
pub const TM_IMAGE_TYPE_CUBE: tm_image_type = 3;
#[doc = " Describes the type of an image."]
pub type tm_image_type = ::std::os::raw::c_int;
#[doc = " Image information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_t {
    #[doc = " One of [[enum tm_image_type]]."]
    pub type_: u32,
    #[doc = " Buffer format UID, use [[tm_buffer_format_api]] to interpret."]
    pub pixel_format: u32,
    #[doc = " Width of image in pixels."]
    pub width: u32,
    #[doc = " Height of image in pixels."]
    pub height: u32,
    #[doc = " Depth of image in pixels, always 1 unless `type == TM_IMAGE_TYPE_3D`."]
    pub depth: u32,
    #[doc = " Number of mip levels in image."]
    pub mip_levels: u32,
    #[doc = " If layers > 1, the image is a texture array."]
    pub layers: u32,
    #[doc = " Size of image in bytes."]
    pub size: u32,
}
#[test]
fn bindgen_test_layout_tm_image_t() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_t>(),
        32usize,
        concat!("Size of: ", stringify!(tm_image_t))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tm_image_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).pixel_format as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(pixel_format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).depth as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(depth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).mip_levels as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(mip_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).layers as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(layers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_t>())).size as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_t),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_archive_o {
    _unused: [u8; 0],
}
#[doc = " Abstract interface used by image loaders for loading image data from an archive."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_archive_i {
    pub inst: *mut tm_image_archive_o,
    #[doc = " Attempts to read `size` of bytes into `buffer` starting at `offset`, returns number of bytes"]
    #[doc = " actually read."]
    pub read: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_archive_o,
            buffer: *mut ::std::os::raw::c_void,
            offset: u64,
            size: u32,
        ) -> u32,
    >,
    #[doc = " Returns the size of the archive."]
    pub size: ::std::option::Option<unsafe extern "C" fn(inst: *mut tm_image_archive_o) -> u64>,
}
#[test]
fn bindgen_test_layout_tm_image_archive_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_archive_i>(),
        24usize,
        concat!("Size of: ", stringify!(tm_image_archive_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_archive_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_archive_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).read as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(read)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_archive_i>())).size as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_archive_i),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_o {
    _unused: [u8; 0],
}
#[doc = " Interface for an \"image loader\" that can load images from an archive."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_i {
    pub inst: *mut tm_image_loader_o,
    #[doc = " Appends a string with all supported file extensions the image loader interface can load to the"]
    #[doc = " carray `output`. Each file extension is separated by the `separator` string."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Use a regular array instead?"]
    pub extensions_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    #[doc = " Appends a string with all supported file descriptions the image loader interface can load to"]
    #[doc = " the carray `output`. Each file extension is separated by the `separator` string."]
    #[doc = ""]
    #[doc = " !!! TODO: API-REVIEW"]
    #[doc = "     Make this optional."]
    pub description_string: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            output: *mut *mut ::std::os::raw::c_char,
            ta: *mut tm_temp_allocator_i,
            separator: *const ::std::os::raw::c_char,
        ),
    >,
    #[doc = " Returns `true` if this loader supports loading an image from `image_archive`. Implemented by"]
    #[doc = " peeking into the archive header to determine the file type."]
    pub support_from_archive: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            image_archive: *mut tm_image_archive_i,
        ) -> bool,
    >,
    #[doc = " Returns `true` if loader supports loading archives with file extension `extension`. Typically"]
    #[doc = " faster than [[support_from_archive()]] since it just needs to compare `extension` against a"]
    #[doc = " known list of supported extensions. `extension` should include the leading dot, e.g `.dds`,"]
    #[doc = " `.tga`, ..."]
    pub support_from_extension: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            extension: *const ::std::os::raw::c_char,
        ) -> bool,
    >,
    #[doc = " Attempts to load an image from `image_archive` into the descriptor `image` and the data array"]
    #[doc = " `bits`. Returns `true` if the image was successfully loaded."]
    #[doc = ""]
    #[doc = " If `bits` is `NULL`, only the image descriptor will be parsed. Use this and `image->size` to"]
    #[doc = " determine the amount of memory to allocate for `bits`."]
    pub load_image: ::std::option::Option<
        unsafe extern "C" fn(
            inst: *mut tm_image_loader_o,
            image_archive: *mut tm_image_archive_i,
            image: *mut tm_image_t,
            bits: *mut u8,
        ) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_tm_image_loader_i() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_loader_i>(),
        48usize,
        concat!("Size of: ", stringify!(tm_image_loader_i))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_loader_i>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_loader_i))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_i>())).inst as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(inst)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).extensions_string as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(extensions_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).description_string as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(description_string)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).support_from_archive as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(support_from_archive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_i>())).support_from_extension as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(support_from_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_i>())).load_image as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_i),
            "::",
            stringify!(load_image)
        )
    );
}
#[doc = " API for adding and removing image loaders."]
#[doc = ""]
#[doc = " !!! TODO: API-REVIEW: Use API registry instead of [[add_loader()]]?"]
#[doc = "     Remove this API and use [[tm_api_registry_api->add_implementation()]] instead?"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm_image_loader_api {
    #[doc = " Adds a new image loader into the registry."]
    pub add_loader: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_image_loader_i)>,
    #[doc = " Removes an image loader from the registry."]
    pub remove_loader: ::std::option::Option<unsafe extern "C" fn(loader: *mut tm_image_loader_i)>,
    #[doc = " Returns the first image loader from the registry that supports loading the image pointed to"]
    #[doc = " by `image_archive`. If no loader is found, 0 is returned."]
    pub loader_from_archive: ::std::option::Option<
        unsafe extern "C" fn(image_archive: *mut tm_image_archive_i) -> *mut tm_image_loader_i,
    >,
    #[doc = " Returns the first image loader from the registry that supports loading the image with the"]
    #[doc = " file `extension`. Typically faster than [[loader_from_archive()]] if the file extension is"]
    #[doc = " known. If no loader is found, 0 is returned."]
    pub loader_from_extension: ::std::option::Option<
        unsafe extern "C" fn(extension: *const ::std::os::raw::c_char) -> *mut tm_image_loader_i,
    >,
    #[doc = " Returns all registered image loader interfaces in `loaders`, pass `NULL` for `loaders` to"]
    #[doc = " query the number of active loaders."]
    pub loaders:
        ::std::option::Option<unsafe extern "C" fn(loaders: *mut *mut tm_image_loader_i) -> u32>,
}
#[test]
fn bindgen_test_layout_tm_image_loader_api() {
    assert_eq!(
        ::std::mem::size_of::<tm_image_loader_api>(),
        40usize,
        concat!("Size of: ", stringify!(tm_image_loader_api))
    );
    assert_eq!(
        ::std::mem::align_of::<tm_image_loader_api>(),
        8usize,
        concat!("Alignment of ", stringify!(tm_image_loader_api))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_api>())).add_loader as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(add_loader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).remove_loader as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(remove_loader)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).loader_from_archive as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loader_from_archive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<tm_image_loader_api>())).loader_from_extension as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loader_from_extension)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tm_image_loader_api>())).loaders as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm_image_loader_api),
            "::",
            stringify!(loaders)
        )
    );
}
pub const TM_INPUT_CONTROLLER_TYPE_NONE: tm_input_controller_type = 0;
pub const TM_INPUT_CONTROLLER_TYPE_KEYBOARD: tm_input_controller_type = 1;
pub const TM_INPUT_CONTROLLER_TYPE_MOUSE: tm_input_controller_type = 2;
pub const TM_INPUT_CONTROLLER_TYPE_GAMEPAD: tm_input_controller_type = 3;
pub const TM_INPUT_CONTROLLER_TYPE_TOUCH: tm_input_controller_type = 4;
pub const TM_INPUT_CONTROLLER_TYPE_PEN: tm_input_controller_type = 5;
pub const TM_INPUT_CONTROLLER_TYPE_OTHER: tm_input_controller_type = -1;
#[doc = " Defines the type of an input controller."]
pub type tm_input_controller_type = ::std::os::raw::c_int;
pub const TM_INPUT_MOUSE_ITEM_NONE: tm_input_mouse_item = 0;
#[doc = " BUTTON_1"]
pub const TM_INPUT_MOUSE_ITEM_BUTTON_LEFT: tm_input_mouse_item = 1;
#[doc = " BUTTON_2"]
pub const TM_INPUT_MOUSE_ITEM_BUTTON_RIGHT: tm_input_mouse_item = 2;
#[doc = " BUTTON_3"]
pub const TM_INPUT_MOUSE_ITEM_BUTTON_MIDDLE: tm_input_mouse_item = 3;
pub const TM_INPUT_MOUSE_ITEM_BUTTON_4: tm_input_mouse_item = 4;
pub const TM_INPUT_MOUSE_ITEM_BUTTON_5: tm_input_mouse_item = 5;
pub const TM_INPUT_MOUSE_ITEM_WHEEL: tm_input_mouse_item = 6;
pub const TM_INPUT_MOUSE_ITEM_MOVE: tm_input_mouse_item = 7;
pub const TM_INPUT_MOUSE_ITEM_POSITION: tm_input_mouse_item = 8;
pub const TM_INPUT_MOUSE_ITEM_COUNT: tm_input_mouse_item = 9;
#[doc = " Common input items for mice."]
pub type tm_input_mouse_item = ::std::os::raw::c_int;
pub const TM_INPUT_PEN_ITEM_NONE: tm_input_pen_item = 0;
pub const TM_INPUT_PEN_ITEM_BUTTON_1: tm_input_pen_item = 1;
pub const TM_INPUT_PEN_ITEM_BUTTON_2: tm_input_pen_item = 2;
pub const TM_INPUT_PEN_ITEM_BUTTON_3: tm_input_pen_item = 3;
pub const TM_INPUT_PEN_ITEM_BUTTON_4: tm_input_pen_item = 4;
pub const TM_INPUT_PEN_ITEM_BUTTON_5: tm_input_pen_item = 5;
pub const TM_INPUT_PEN_ITEM_WHEEL: tm_input_pen_item = 6;
pub const TM_INPUT_PEN_ITEM_POSITION: tm_input_pen_item = 7;
pub const TM_INPUT_PEN_ITEM_PRESSURE: tm_input_pen_item = 8;
pub const TM_INPUT_PEN_ITEM_ROTATION: tm_input_pen_item = 9;
pub const TM_INPUT_PEN_ITEM_TILT: tm_input_pen_item = 10;
pub const TM_INPUT_PEN_ITEM_INVERTED: tm_input_pen_item = 11;
pub const TM_INPUT_PEN_ITEM_ERASER: tm_input_pen_item = 12;
pub const TM_INPUT_PEN_ITEM_COUNT: tm_input_pen_item = 13;
#[doc = " Common input items for pens."]
pub type tm_input_pen_item = ::std::os::raw::c_int;
pub const TM_INPUT_TOUCH_ITEM_NONE: tm_input_touch_item = 0;
pub const TM_INPUT_TOUCH_ITEM_TOUCH: tm_input_touch_item = 1;
pub const TM_INPUT_TOUCH_ITEM_POSITION: tm_input_touch_item = 2;
pub const TM_INPUT_TOUCH_ITEM_PRESSURE: tm_input_touch_item = 3;
pub const TM_INPUT_TOUCH_ITEM_ORIENTATION: tm_input_touch_item = 4;
pub const TM_INPUT_TOUCH_ITEM_COUNT: tm_input_touch_item = 5;
#[doc = " Common input items for touches."]
pub type tm_input_touch_item = ::std::os::raw::c_int;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_NONE: tm_input_keyboard_item = 0;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_LBUTTON: tm_input_keyboard_item = 1;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_RBUTTON: tm_input_keyboard_item = 2;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_CANCEL: tm_input_keyboard_item = 3;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_MBUTTON: tm_input_keyboard_item = 4;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_XBUTTON1: tm_input_keyboard_item = 5;
#[doc = " Standard windows keys."]
pub const TM_INPUT_KEYBOARD_ITEM_XBUTTON2: tm_input_keyboard_item = 6;
#[doc = " VK_BACK"]
pub const TM_INPUT_KEYBOARD_ITEM_BACKSPACE: tm_input_keyboard_item = 8;
pub const TM_INPUT_KEYBOARD_ITEM_TAB: tm_input_keyboard_item = 9;
pub const TM_INPUT_KEYBOARD_ITEM_CLEAR: tm_input_keyboard_item = 12;
#[doc = " VK_RETURN"]
pub const TM_INPUT_KEYBOARD_ITEM_ENTER: tm_input_keyboard_item = 13;
pub const TM_INPUT_KEYBOARD_ITEM_SHIFT: tm_input_keyboard_item = 16;
pub const TM_INPUT_KEYBOARD_ITEM_CONTROL: tm_input_keyboard_item = 17;
pub const TM_INPUT_KEYBOARD_ITEM_MENU: tm_input_keyboard_item = 18;
pub const TM_INPUT_KEYBOARD_ITEM_PAUSE: tm_input_keyboard_item = 19;
#[doc = " VK_CAPITAL"]
pub const TM_INPUT_KEYBOARD_ITEM_CAPSLOCK: tm_input_keyboard_item = 20;
pub const TM_INPUT_KEYBOARD_ITEM_KANA: tm_input_keyboard_item = 21;
pub const TM_INPUT_KEYBOARD_ITEM_JUNJA: tm_input_keyboard_item = 23;
pub const TM_INPUT_KEYBOARD_ITEM_FINAL: tm_input_keyboard_item = 24;
pub const TM_INPUT_KEYBOARD_ITEM_HANJA: tm_input_keyboard_item = 25;
pub const TM_INPUT_KEYBOARD_ITEM_KANJI: tm_input_keyboard_item = 25;
pub const TM_INPUT_KEYBOARD_ITEM_ESCAPE: tm_input_keyboard_item = 27;
#[doc = " IME"]
pub const TM_INPUT_KEYBOARD_ITEM_CONVERT: tm_input_keyboard_item = 28;
#[doc = " IME"]
pub const TM_INPUT_KEYBOARD_ITEM_NONCONVERT: tm_input_keyboard_item = 29;
#[doc = " IME"]
pub const TM_INPUT_KEYBOARD_ITEM_ACCEPT: tm_input_keyboard_item = 30;
#[doc = " IME"]
pub const TM_INPUT_KEYBOARD_ITEM_MODECHANGE: tm_input_keyboard_item = 31;
pub const TM_INPUT_KEYBOARD_ITEM_SPACE: tm_input_keyboard_item = 32;
#[doc = " VK_PRIOR"]
pub const TM_INPUT_KEYBOARD_ITEM_PAGEUP: tm_input_keyboard_item = 33;
#[doc = " VK_NEXT"]
pub const TM_INPUT_KEYBOARD_ITEM_PAGEDOWN: tm_input_keyboard_item = 34;
pub const TM_INPUT_KEYBOARD_ITEM_END: tm_input_keyboard_item = 35;
pub const TM_INPUT_KEYBOARD_ITEM_HOME: tm_input_keyboard_item = 36;
pub const TM_INPUT_KEYBOARD_ITEM_LEFT: tm_input_keyboard_item = 37;
pub const TM_INPUT_KEYBOARD_ITEM_UP: tm_input_keyboard_item = 38;
pub const TM_INPUT_KEYBOARD_ITEM_RIGHT: tm_input_keyboard_item = 39;
pub const TM_INPUT_KEYBOARD_ITEM_DOWN: tm_input_keyboard_item = 40;
pub const TM_INPUT_KEYBOARD_ITEM_SELECT: tm_input_keyboard_item = 41;
pub const TM_INPUT_KEYBOARD_ITEM_PRINT: tm_input_keyboard_item = 42;
pub const TM_INPUT_KEYBOARD_ITEM_EXECUTE: tm_input_keyboard_item = 43;
#[doc = " VK_SNAPSHOT, SysRq"]
pub const TM_INPUT_KEYBOARD_ITEM_PRINTSCREEN: tm_input_keyboard_item = 44;
pub const TM_INPUT_KEYBOARD_ITEM_INSERT: tm_input_keyboard_item = 45;
pub const TM_INPUT_KEYBOARD_ITEM_DELETE: tm_input_keyboard_item = 46;
pub const TM_INPUT_KEYBOARD_ITEM_HELP: tm_input_keyboard_item = 47;
pub const TM_INPUT_KEYBOARD_ITEM_0: tm_input_keyboard_item = 48;
pub const TM_INPUT_KEYBOARD_ITEM_1: tm_input_keyboard_item = 49;
pub const TM_INPUT_KEYBOARD_ITEM_2: tm_input_keyboard_item = 50;
pub const TM_INPUT_KEYBOARD_ITEM_3: tm_input_keyboard_item = 51;
pub const TM_INPUT_KEYBOARD_ITEM_4: tm_input_keyboard_item = 52;
pub const TM_INPUT_KEYBOARD_ITEM_5: tm_input_keyboard_item = 53;
pub const TM_INPUT_KEYBOARD_ITEM_6: tm_input_keyboard_item = 54;
pub const TM_INPUT_KEYBOARD_ITEM_7: tm_input_keyboard_item = 55;
pub const TM_INPUT_KEYBOARD_ITEM_8: tm_input_keyboard_item = 56;
pub const TM_INPUT_KEYBOARD_ITEM_9: tm_input_keyboard_item = 57;
pub const TM_INPUT_KEYBOARD_ITEM_A: tm_input_keyboard_item = 65;
pub const TM_INPUT_KEYBOARD_ITEM_B: tm_input_keyboard_item = 66;
pub const TM_INPUT_KEYBOARD_ITEM_C: tm_input_keyboard_item = 67;
pub const TM_INPUT_KEYBOARD_ITEM_D: tm_input_keyboard_item = 68;
pub const TM_INPUT_KEYBOARD_ITEM_E: tm_input_keyboard_item = 69;
pub const TM_INPUT_KEYBOARD_ITEM_F: tm_input_keyboard_item = 70;
pub const TM_INPUT_KEYBOARD_ITEM_G: tm_input_keyboard_item = 71;
pub const TM_INPUT_KEYBOARD_ITEM_H: tm_input_keyboard_item = 72;
pub const TM_INPUT_KEYBOARD_ITEM_I: tm_input_keyboard_item = 73;
pub const TM_INPUT_KEYBOARD_ITEM_J: tm_input_keyboard_item = 74;
pub const TM_INPUT_KEYBOARD_ITEM_K: tm_input_keyboard_item = 75;
pub const TM_INPUT_KEYBOARD_ITEM_L: tm_input_keyboard_item = 76;
pub const TM_INPUT_KEYBOARD_ITEM_M: tm_input_keyboard_item = 77;
pub const TM_INPUT_KEYBOARD_ITEM_N: tm_input_keyboard_item = 78;
pub const TM_INPUT_KEYBOARD_ITEM_O: tm_input_keyboard_item = 79;
pub const TM_INPUT_KEYBOARD_ITEM_P: tm_input_keyboard_item = 80;
pub const TM_INPUT_KEYBOARD_ITEM_Q: tm_input_keyboard_item = 81;
pub const TM_INPUT_KEYBOARD_ITEM_R: tm_input_keyboard_item = 82;
pub const TM_INPUT_KEYBOARD_ITEM_S: tm_input_keyboard_item = 83;
pub const TM_INPUT_KEYBOARD_ITEM_T: tm_input_keyboard_item = 84;
pub const TM_INPUT_KEYBOARD_ITEM_U: tm_input_keyboard_item = 85;
pub const TM_INPUT_KEYBOARD_ITEM_V: tm_input_keyboard_item = 86;
pub const TM_INPUT_KEYBOARD_ITEM_W: tm_input_keyboard_item = 87;
pub const TM_INPUT_KEYBOARD_ITEM_X: tm_input_keyboard_item = 88;
pub const TM_INPUT_KEYBOARD_ITEM_Y: tm_input_keyboard_item = 89;
pub const TM_INPUT_KEYBOARD_ITEM_Z: tm_input_keyboard_item = 90;
pub const TM_INPUT_KEYBOARD_ITEM_LWIN: tm_input_keyboard_item = 91;
pub const TM_INPUT_KEYBOARD_ITEM_RWIN: tm_input_keyboard_item = 92;
pub const TM_INPUT_KEYBOARD_ITEM_APPS: tm_input_keyboard_item = 93;
pub const TM_INPUT_KEYBOARD_ITEM_SLEEP: tm_input_keyboard_item = 95;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD0: tm_input_keyboard_item = 96;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD1: tm_input_keyboard_item = 97;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD2: tm_input_keyboard_item = 98;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD3: tm_input_keyboard_item = 99;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD4: tm_input_keyboard_item = 100;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD5: tm_input_keyboard_item = 101;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD6: tm_input_keyboard_item = 102;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD7: tm_input_keyboard_item = 103;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD8: tm_input_keyboard_item = 104;
pub const TM_INPUT_KEYBOARD_ITEM_NUMPAD9: tm_input_keyboard_item = 105;
#[doc = " VK_MULTIPLY"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADASTERISK: tm_input_keyboard_item = 106;
#[doc = " VK_ADD"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADPLUS: tm_input_keyboard_item = 107;
#[doc = " VK_SEPARATOR"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADENTER: tm_input_keyboard_item = 108;
#[doc = " VK_SUBTRACT"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADMINUS: tm_input_keyboard_item = 109;
#[doc = " VK_DECIMAL"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADDOT: tm_input_keyboard_item = 110;
#[doc = " VK_DIVIDE"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADSLASH: tm_input_keyboard_item = 111;
pub const TM_INPUT_KEYBOARD_ITEM_F1: tm_input_keyboard_item = 112;
pub const TM_INPUT_KEYBOARD_ITEM_F2: tm_input_keyboard_item = 113;
pub const TM_INPUT_KEYBOARD_ITEM_F3: tm_input_keyboard_item = 114;
pub const TM_INPUT_KEYBOARD_ITEM_F4: tm_input_keyboard_item = 115;
pub const TM_INPUT_KEYBOARD_ITEM_F5: tm_input_keyboard_item = 116;
pub const TM_INPUT_KEYBOARD_ITEM_F6: tm_input_keyboard_item = 117;
pub const TM_INPUT_KEYBOARD_ITEM_F7: tm_input_keyboard_item = 118;
pub const TM_INPUT_KEYBOARD_ITEM_F8: tm_input_keyboard_item = 119;
pub const TM_INPUT_KEYBOARD_ITEM_F9: tm_input_keyboard_item = 120;
pub const TM_INPUT_KEYBOARD_ITEM_F10: tm_input_keyboard_item = 121;
pub const TM_INPUT_KEYBOARD_ITEM_F11: tm_input_keyboard_item = 122;
pub const TM_INPUT_KEYBOARD_ITEM_F12: tm_input_keyboard_item = 123;
pub const TM_INPUT_KEYBOARD_ITEM_F13: tm_input_keyboard_item = 124;
pub const TM_INPUT_KEYBOARD_ITEM_F14: tm_input_keyboard_item = 125;
pub const TM_INPUT_KEYBOARD_ITEM_F15: tm_input_keyboard_item = 126;
pub const TM_INPUT_KEYBOARD_ITEM_F16: tm_input_keyboard_item = 127;
pub const TM_INPUT_KEYBOARD_ITEM_F17: tm_input_keyboard_item = 128;
pub const TM_INPUT_KEYBOARD_ITEM_F18: tm_input_keyboard_item = 129;
pub const TM_INPUT_KEYBOARD_ITEM_F19: tm_input_keyboard_item = 130;
pub const TM_INPUT_KEYBOARD_ITEM_F20: tm_input_keyboard_item = 131;
pub const TM_INPUT_KEYBOARD_ITEM_F21: tm_input_keyboard_item = 132;
pub const TM_INPUT_KEYBOARD_ITEM_F22: tm_input_keyboard_item = 133;
pub const TM_INPUT_KEYBOARD_ITEM_F23: tm_input_keyboard_item = 134;
pub const TM_INPUT_KEYBOARD_ITEM_F24: tm_input_keyboard_item = 135;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_VIEW: tm_input_keyboard_item = 136;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_MENU: tm_input_keyboard_item = 137;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_UP: tm_input_keyboard_item = 138;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_DOWN: tm_input_keyboard_item = 139;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_LEFT: tm_input_keyboard_item = 140;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_RIGHT: tm_input_keyboard_item = 141;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_ACCEPT: tm_input_keyboard_item = 142;
pub const TM_INPUT_KEYBOARD_ITEM_NAVIGATION_CANCEL: tm_input_keyboard_item = 143;
pub const TM_INPUT_KEYBOARD_ITEM_NUMLOCK: tm_input_keyboard_item = 144;
#[doc = " VK_SCROLL"]
pub const TM_INPUT_KEYBOARD_ITEM_SCROLLLOCK: tm_input_keyboard_item = 145;
#[doc = " VK_OEM_NEC_EQUAL"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADEQUAL: tm_input_keyboard_item = 146;
#[doc = " 'Dictionary' key"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FJ_JISHO: tm_input_keyboard_item = 146;
#[doc = " 'Unregister word' key"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FJ_MASSHOU: tm_input_keyboard_item = 147;
#[doc = " 'Register word' key"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FJ_TOUROKU: tm_input_keyboard_item = 148;
#[doc = " 'Left OYAYUBI' key"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FJ_LOYA: tm_input_keyboard_item = 149;
#[doc = " 'Right OYAYUBI' key"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FJ_ROYA: tm_input_keyboard_item = 150;
#[doc = " VK_LSHIFT"]
pub const TM_INPUT_KEYBOARD_ITEM_LEFTSHIFT: tm_input_keyboard_item = 160;
#[doc = " VK_RSHIFT"]
pub const TM_INPUT_KEYBOARD_ITEM_RIGHTSHIFT: tm_input_keyboard_item = 161;
#[doc = " VK_LCONTROL"]
pub const TM_INPUT_KEYBOARD_ITEM_LEFTCONTROL: tm_input_keyboard_item = 162;
#[doc = " VK_RCONTROL"]
pub const TM_INPUT_KEYBOARD_ITEM_RIGHTCONTROL: tm_input_keyboard_item = 163;
#[doc = " VK_LMENU"]
pub const TM_INPUT_KEYBOARD_ITEM_LEFTALT: tm_input_keyboard_item = 164;
#[doc = " VK_RMENU"]
pub const TM_INPUT_KEYBOARD_ITEM_RIGHTALT: tm_input_keyboard_item = 165;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_BACK: tm_input_keyboard_item = 166;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_FORWARD: tm_input_keyboard_item = 167;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_REFRESH: tm_input_keyboard_item = 168;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_STOP: tm_input_keyboard_item = 169;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_SEARCH: tm_input_keyboard_item = 170;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_FAVORITES: tm_input_keyboard_item = 171;
pub const TM_INPUT_KEYBOARD_ITEM_BROWSER_HOME: tm_input_keyboard_item = 172;
pub const TM_INPUT_KEYBOARD_ITEM_VOLUME_MUTE: tm_input_keyboard_item = 173;
pub const TM_INPUT_KEYBOARD_ITEM_VOLUME_DOWN: tm_input_keyboard_item = 174;
pub const TM_INPUT_KEYBOARD_ITEM_VOLUME_UP: tm_input_keyboard_item = 175;
pub const TM_INPUT_KEYBOARD_ITEM_MEDIA_NEXT_TRACK: tm_input_keyboard_item = 176;
pub const TM_INPUT_KEYBOARD_ITEM_MEDIA_PREV_TRACK: tm_input_keyboard_item = 177;
pub const TM_INPUT_KEYBOARD_ITEM_MEDIA_STOP: tm_input_keyboard_item = 178;
pub const TM_INPUT_KEYBOARD_ITEM_MEDIA_PLAY_PAUSE: tm_input_keyboard_item = 179;
pub const TM_INPUT_KEYBOARD_ITEM_LAUNCH_MAIL: tm_input_keyboard_item = 180;
pub const TM_INPUT_KEYBOARD_ITEM_LAUNCH_MEDIA_SELECT: tm_input_keyboard_item = 181;
pub const TM_INPUT_KEYBOARD_ITEM_LAUNCH_APP1: tm_input_keyboard_item = 182;
pub const TM_INPUT_KEYBOARD_ITEM_LAUNCH_APP2: tm_input_keyboard_item = 183;
#[doc = " VK_OEM_1"]
pub const TM_INPUT_KEYBOARD_ITEM_SEMICOLON: tm_input_keyboard_item = 186;
#[doc = " VK_OEM_PLUS"]
pub const TM_INPUT_KEYBOARD_ITEM_EQUAL: tm_input_keyboard_item = 187;
#[doc = " VK_OEM_COMMA"]
pub const TM_INPUT_KEYBOARD_ITEM_COMMA: tm_input_keyboard_item = 188;
#[doc = " VK_OEM_MINUS"]
pub const TM_INPUT_KEYBOARD_ITEM_MINUS: tm_input_keyboard_item = 189;
#[doc = " VK_OEM_PERIOD"]
pub const TM_INPUT_KEYBOARD_ITEM_DOT: tm_input_keyboard_item = 190;
#[doc = " VK_OEM_2"]
pub const TM_INPUT_KEYBOARD_ITEM_SLASH: tm_input_keyboard_item = 191;
#[doc = " VK_OEM_3"]
pub const TM_INPUT_KEYBOARD_ITEM_GRAVE: tm_input_keyboard_item = 192;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_A: tm_input_keyboard_item = 195;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_B: tm_input_keyboard_item = 196;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_X: tm_input_keyboard_item = 197;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_Y: tm_input_keyboard_item = 198;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_SHOULDER: tm_input_keyboard_item = 199;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_SHOULDER: tm_input_keyboard_item = 200;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_TRIGGER: tm_input_keyboard_item = 201;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_TRIGGER: tm_input_keyboard_item = 202;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_UP: tm_input_keyboard_item = 203;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_DOWN: tm_input_keyboard_item = 204;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_LEFT: tm_input_keyboard_item = 205;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_DPAD_RIGHT: tm_input_keyboard_item = 206;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_MENU: tm_input_keyboard_item = 207;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_VIEW: tm_input_keyboard_item = 208;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_BUTTON: tm_input_keyboard_item = 209;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_BUTTON: tm_input_keyboard_item = 210;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_UP: tm_input_keyboard_item = 211;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_DOWN: tm_input_keyboard_item = 212;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_RIGHT: tm_input_keyboard_item = 213;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_LEFT_THUMBSTICK_LEFT: tm_input_keyboard_item = 214;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_UP: tm_input_keyboard_item = 215;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_DOWN: tm_input_keyboard_item = 216;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_RIGHT: tm_input_keyboard_item = 217;
pub const TM_INPUT_KEYBOARD_ITEM_GAMEPAD_RIGHT_THUMBSTICK_LEFT: tm_input_keyboard_item = 218;
#[doc = "  VK_OEM_4"]
pub const TM_INPUT_KEYBOARD_ITEM_LEFTBRACE: tm_input_keyboard_item = 219;
#[doc = " VK_OEM_5"]
pub const TM_INPUT_KEYBOARD_ITEM_BACKSLASH: tm_input_keyboard_item = 220;
#[doc = "  VK_OEM_6"]
pub const TM_INPUT_KEYBOARD_ITEM_RIGHTBRACE: tm_input_keyboard_item = 221;
#[doc = "  VK_OEM_7"]
pub const TM_INPUT_KEYBOARD_ITEM_APOSTROPHE: tm_input_keyboard_item = 222;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_8: tm_input_keyboard_item = 223;
#[doc = "  'AX' key on Japanese AX kbd"]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_AX: tm_input_keyboard_item = 225;
#[doc = "  \"<>\" or \"\\|\" on RT 102-key kbd."]
pub const TM_INPUT_KEYBOARD_ITEM_OEM_102: tm_input_keyboard_item = 226;
#[doc = "  Help key on ICO"]
pub const TM_INPUT_KEYBOARD_ITEM_ICO_HELP: tm_input_keyboard_item = 227;
#[doc = "  00 key on ICO"]
pub const TM_INPUT_KEYBOARD_ITEM_ICO_00: tm_input_keyboard_item = 228;
pub const TM_INPUT_KEYBOARD_ITEM_PROCESSKEY: tm_input_keyboard_item = 229;
pub const TM_INPUT_KEYBOARD_ITEM_ICO_CLEAR: tm_input_keyboard_item = 230;
pub const TM_INPUT_KEYBOARD_ITEM_PACKET: tm_input_keyboard_item = 231;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_RESET: tm_input_keyboard_item = 233;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_JUMP: tm_input_keyboard_item = 234;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_PA1: tm_input_keyboard_item = 235;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_PA2: tm_input_keyboard_item = 236;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_PA3: tm_input_keyboard_item = 237;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_WSCTRL: tm_input_keyboard_item = 238;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_CUSEL: tm_input_keyboard_item = 239;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_ATTN: tm_input_keyboard_item = 240;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_FINISH: tm_input_keyboard_item = 241;
pub const TM_INPUT_KEYBOARD_ITEM_COPY: tm_input_keyboard_item = 242;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_AUTO: tm_input_keyboard_item = 243;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_ENLW: tm_input_keyboard_item = 244;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_BACKTAB: tm_input_keyboard_item = 245;
pub const TM_INPUT_KEYBOARD_ITEM_ATTN: tm_input_keyboard_item = 246;
pub const TM_INPUT_KEYBOARD_ITEM_CRSEL: tm_input_keyboard_item = 247;
pub const TM_INPUT_KEYBOARD_ITEM_EXSEL: tm_input_keyboard_item = 248;
pub const TM_INPUT_KEYBOARD_ITEM_EREOF: tm_input_keyboard_item = 249;
pub const TM_INPUT_KEYBOARD_ITEM_PLAY: tm_input_keyboard_item = 250;
pub const TM_INPUT_KEYBOARD_ITEM_ZOOM: tm_input_keyboard_item = 251;
pub const TM_INPUT_KEYBOARD_ITEM_NONAME: tm_input_keyboard_item = 252;
pub const TM_INPUT_KEYBOARD_ITEM_PA1: tm_input_keyboard_item = 253;
pub const TM_INPUT_KEYBOARD_ITEM_OEM_CLEAR: tm_input_keyboard_item = 254;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_HASHTILDE: tm_input_keyboard_item = 255;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_102ND: tm_input_keyboard_item = 256;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_COMPOSE: tm_input_keyboard_item = 257;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_POWER: tm_input_keyboard_item = 258;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_OPEN: tm_input_keyboard_item = 259;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_PROPS: tm_input_keyboard_item = 260;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_FRONT: tm_input_keyboard_item = 261;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_STOP: tm_input_keyboard_item = 262;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_AGAIN: tm_input_keyboard_item = 263;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_UNDO: tm_input_keyboard_item = 264;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_CUT: tm_input_keyboard_item = 265;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_PASTE: tm_input_keyboard_item = 266;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_FIND: tm_input_keyboard_item = 267;
#[doc = " Keys not available as Windows virtual keys."]
#[doc = ""]
#[doc = " I've tried as best I can to match up the key codes from the OS X HID input system with"]
#[doc = " Windows Virtual Key Codes, but I might have missed something. I.e., some of the keys listed"]
#[doc = " below might be duplicates of the Windows keys above. We should test with a bunch of keyboards"]
#[doc = " on OS X and Windows and see that we have the best key matchup possible."]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADCOMMA: tm_input_keyboard_item = 268;
#[doc = " Keyboard International1"]
pub const TM_INPUT_KEYBOARD_ITEM_RO: tm_input_keyboard_item = 269;
#[doc = " Keyboard International2"]
pub const TM_INPUT_KEYBOARD_ITEM_KATAKANAHIRAGANA: tm_input_keyboard_item = 270;
#[doc = " Keyboard International3"]
pub const TM_INPUT_KEYBOARD_ITEM_YEN: tm_input_keyboard_item = 271;
#[doc = " Keyboard International4"]
pub const TM_INPUT_KEYBOARD_ITEM_HENKAN: tm_input_keyboard_item = 272;
#[doc = " Keyboard International5"]
pub const TM_INPUT_KEYBOARD_ITEM_MUHENKAN: tm_input_keyboard_item = 273;
#[doc = " Keyboard International6"]
pub const TM_INPUT_KEYBOARD_ITEM_NUMPADJPCOMMA: tm_input_keyboard_item = 274;
pub const TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_7: tm_input_keyboard_item = 275;
pub const TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_8: tm_input_keyboard_item = 276;
pub const TM_INPUT_KEYBOARD_ITEM_INTERNATIONAL_9: tm_input_keyboard_item = 277;
#[doc = " Keyboard LANG1"]
pub const TM_INPUT_KEYBOARD_ITEM_HANGEUL: tm_input_keyboard_item = 278;
#[doc = " Keyboard LANG3"]
pub const TM_INPUT_KEYBOARD_ITEM_KATAKANA: tm_input_keyboard_item = 279;
#[doc = " Keyboard LANG4"]
pub const TM_INPUT_KEYBOARD_ITEM_HIRAGANA: tm_input_keyboard_item = 280;
#[doc = " Keyboard LANG5"]
pub const TM_INPUT_KEYBOARD_ITEM_ZENKAKUHANKAKU: tm_input_keyboard_item = 281;
pub const TM_INPUT_KEYBOARD_ITEM_LANG_6: tm_input_keyboard_item = 282;
pub const TM_INPUT_KEYBOARD_ITEM_LANG_7: tm_input_keyboard_item = 283;
pub const TM_INPUT_KEYBOARD_ITEM_LANG_8: tm_input_keyboard_item = 284;
pub const TM_INPUT_KEYBOARD_ITEM_LANG_9: tm_input_keyboard_item = 285;
